{
    "TSLA": {
        "news_count": 42,
        "30_day_news": {
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Tesla (TSLA) stock price climbs ahead of Nvidia earnings as Autopilot lawsuits return to focus TechStock²",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.4067
                    },
                    {
                        "summary": "Tesla (NASDAQ:TSLA) Stock Price Up 1.9% - What's Next? MarketBeat",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3708
                    },
                    {
                        "summary": "Dakota Wealth Management Lowers Stock Position in Tesla, Inc. $TSLA MarketBeat",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.366
                    },
                    {
                        "summary": "GM, F and TSLA race to turn software, subscriptions and connected tech into steadier, higher-margin revenue streams.",
                        "source": "Yahoo! Finance: TSLA News",
                        "semantic_score": 0.3525
                    },
                    {
                        "summary": "His latest SEC filing reveals that the venture capitalist's hedge fund sold its entire stock portfolio last quarter.",
                        "source": "Yahoo! Finance: TSLA News",
                        "semantic_score": 0.2764
                    },
                    {
                        "summary": "Electric vehicles (EVs) are facing market losses from all directions. Yahoo Finance Senior Autos Reporter Pras Subramanian chats with Asking for a Trend host Josh Lipton to discuss the latest developments for automakers Tesla (TSLA), Lamborghini (VWAGY), and Lucid (LCID). To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend.",
                        "source": "Yahoo! Finance: TSLA News",
                        "semantic_score": 0.2682
                    }
                ],
                "regulation": [
                    {
                        "summary": "Tesla stock rises as lawsuits hit headlines; TSLA investors eye Nvidia next Bez Kabli",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3239
                    }
                ],
                "general": [
                    {
                        "summary": "“That’s Not Investing. That’s Speculation.” Tesla Stock (NASDAQ:TSLA) Gains Despite Bearish Outlook on Optimus TipRanks",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3898
                    },
                    {
                        "summary": "SYM, TSLA Stocks Rise On Reports Of Upcoming Govt. Meeting To Discuss Robotics Policies Stocktwits",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2802
                    },
                    {
                        "summary": "TSLA Stock Today: February 25 – China Space Scare Tempers AI Hype Meyka",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2295
                    },
                    {
                        "summary": "Is Tesla’s Robotaxi Safety Scrutiny Reshaping the Autonomy-Led Investment Case for TSLA? simplywall.st",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.1914
                    },
                    {
                        "summary": "Tesla has begun winding down production of its premium Model S and Model X to free Fremont factory capacity for its Optimus humanoid robot program, while ramping capital spending above US$20.00 billion for robotaxis, Cybercab and AI infrastructure amid weaker EV demand and ongoing regulatory and legal scrutiny of its self-driving features. This pivot accelerates Tesla’s transformation from a primarily electric-vehicle manufacturer into an AI-and-robotics platform, raising fresh questions...",
                        "source": "Yahoo! Finance: TSLA News",
                        "semantic_score": 0.182
                    },
                    {
                        "summary": "Trojan, the platform which many of you likely remember as the Solana-native Unibot before its rebrand, officially announced a full-scale integration with Hyperliquid to allow trading of traditional assets like Tesla, Gold, and the S&P 500. These trading bots are upgrading from meme coins and on-chain launches. They are now ...",
                        "source": "Yahoo! Finance: TSLA News",
                        "semantic_score": 0.1258
                    }
                ]
            },
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "Despite rallying as much as 130% last year, Tesla Inc (NASDAQ: TSLA) has had a poor start to 2026. With its shares around $400, they&rsquo;re down nearly 20% from December&rsquo;s all-time high. At first glance, this may sound like a buying opportunity, yet the stock&rsquo;s price-to-earnings (P/",
                        "source": "TSLA Feed",
                        "semantic_score": 0.429
                    },
                    {
                        "summary": "Tesla (NASDAQ:TSLA) Stock Price Up 2.4% - What's Next? MarketBeat",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3577
                    },
                    {
                        "summary": "Tesla: Decommissioning Legacy Auto To Birth The AI Economy (NASDAQ:TSLA) Seeking Alpha",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.23
                    }
                ],
                "regulation": [
                    {
                        "summary": "Tesla Stock: Is TSLA Outperforming the Consumer Discretionary Sector? Barchart.com",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3975
                    }
                ],
                "general": [
                    {
                        "summary": "Tesla (TSLA) Valuation Check After Recent Pullback And Diverging Growth Narratives simplywall.st",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3801
                    },
                    {
                        "summary": "“Wrongfully and Baselessly”: Tesla Stock (NASDAQ:TSLA) Gains as Firm Pursues California TipRanks",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3458
                    },
                    {
                        "summary": "Tesla (TSLA) Stock: The EU Numbers That Investors Can’t Ignore Blockonomi",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3184
                    },
                    {
                        "summary": "Tesla Stock (TSLA) Slides as China’s BYD Extends EU Lead after 2025 EV Shake-Up TipRanks",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2935
                    },
                    {
                        "summary": "Tesla (TSLA) Stock: EU Registrations Fall 17% as BYD Surges 165% CoinCentral",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2863
                    },
                    {
                        "summary": "Recently, Zacks.com users have been paying close attention to Tesla (TSLA). This makes it worthwhile to examine what the stock has in store.",
                        "source": "TSLA Feed",
                        "semantic_score": 0.2669
                    },
                    {
                        "summary": "Tesla EU Registrations Fall 17% in Another Blow for TSLA Stock TipRanks",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2643
                    },
                    {
                        "summary": "What's Going On With Ford Motor Stock Tuesday? - Ford Motor (NYSE:F), Tesla (NASDAQ:TSLA) Benzinga",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2457
                    }
                ]
            },
            "2026-02-10": {
                "analyst": [
                    {
                        "summary": "SA analyst upgrades/downgrades: TSLA, MRK, CRWD, STLA",
                        "source": "Tesla, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3903
                    }
                ]
            },
            "2026-02-22": {
                "analyst": [
                    {
                        "summary": "Mixed Analyst Sentiment on Tesla (TSLA) Post 5 New Collisions in the “Robotaxi” Fleet Yahoo Finance",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2848
                    }
                ]
            },
            "2026-02-26": {
                "corporate": [
                    {
                        "summary": "Investor Ross Gerber of the investment firm Gerber Kawasaki has warned Tesla Inc. (NASDAQ:TSLA) investors of the potential ramifications of stock-based employee compensation, drawing parallels with Meta Platforms Inc.'s (NASDAQ:META) share buybacks. A Real Cost The investor took to the social media platform X on Monday, warning Tesla shareholders that stock compensation was a real cost for companies. \"Tesla shareholders should pay attention to this regarding meta,\" he said, then shared a quote f",
                        "source": "Yahoo! Finance: TSLA News",
                        "semantic_score": 0.2726
                    }
                ],
                "general": [
                    {
                        "summary": "Tesla’s Rocky February: TSLA Stock to Boom from Optimus Robots? InteractiveCrypto",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2265
                    }
                ]
            },
            "2026-02-23": {
                "general": [
                    {
                        "summary": "As Tesla Cuts Cybertruck Prices, Should You Buy TSLA Stock? Barchart.com",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2837
                    },
                    {
                        "summary": "Tesla Stock (TSLA) Opinions on Model Y Six-Seater Approval in Australia Quiver Quantitative",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2292
                    },
                    {
                        "summary": "Tesla Stock (NASDAQ:TSLA) Plunges With FSD Data Issues TipRanks",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2055
                    }
                ]
            },
            "2026-01-29": {
                "earnings": [
                    {
                        "summary": "Wells Fargo & Company Has Lowered Expectations for Tesla (NASDAQ:TSLA) Stock Price MarketBeat",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3687
                    },
                    {
                        "summary": "Tesla (NASDAQ: TSLA) Stock Price Prediction and Forecast 2026-2030 (Jan 29) 24/7 Wall St.",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2582
                    }
                ]
            },
            "2026-01-28": {
                "earnings": [
                    {
                        "summary": "Tesla (TSLA) Q4 2025 Earnings Preview: A High-Stakes Test of Patience and Promise marketpulse.com",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.4188
                    }
                ],
                "general": [
                    {
                        "summary": "Tesla Stock: Pie In The Sky Valuations And Falling Sales - But Don’t Sell It Short (TSLA) Seeking Alpha",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3438
                    }
                ]
            },
            "2026-02-17": {
                "general": [
                    {
                        "summary": "As Tesla Gains U.S. Market Share, Should You Buy TSLA Stock? Barchart.com",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3166
                    }
                ]
            },
            "2026-02-20": {
                "general": [
                    {
                        "summary": "As Tesla Launches FSD Subscriptions, Should You Buy, Sell, or Hold TSLA Stock? Yahoo Finance",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2715
                    }
                ]
            },
            "2026-02-01": {
                "general": [
                    {
                        "summary": "Tesla: The Valuation Makes No Sense (NASDAQ:TSLA) Seeking Alpha",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.3468
                    }
                ]
            },
            "2026-02-04": {
                "general": [
                    {
                        "summary": "Does Tesla (TSLA) Share Price Reflect Its Role In The Electric Vehicle Shift? Yahoo Finance",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2858
                    },
                    {
                        "summary": "Waymo Raises Another Red Flag for Tesla. Should You Sell TSLA Stock in February 2026? Barchart.com",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.2701
                    }
                ]
            },
            "2026-02-02": {
                "general": [
                    {
                        "summary": "Why Is Tesla Stock (TSLA) Falling Today? TipRanks",
                        "source": "\"TSLA stock\" - Google News",
                        "semantic_score": 0.361
                    }
                ]
            }
        }
    },
    "NVDA": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-26": {
                "earnings": [
                    {
                        "summary": "Key PointsFourth-quarter revenue and adjusted earnings per share (EPS) soared 73% and 82%, respectively, year over year, easily surpassing Wall Street's expectations.",
                        "source": "NVDA Feed",
                        "semantic_score": 0.5775
                    },
                    {
                        "summary": "NVDA Stock Gains After NVIDIA Posts $68.1B Q4 Revenue Beat Eudaimonia and Co",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.4504
                    },
                    {
                        "summary": "NVIDIA Corp (NVDA) reports a remarkable 73% year-over-year revenue increase, driven by robust Data Center performance and strategic advancements in AI infrastructure.",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.3851
                    },
                    {
                        "summary": "CNBC Daily Open: Nvidia’s earnings beat and other AI news give markets relief — for now CNBC",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3773
                    },
                    {
                        "summary": "Will NVDA Stock Price Hit $250 in 2026? Latest Earnings Analysis intellectia.ai",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3643
                    },
                    {
                        "summary": "AI optimism and sector move lifting KLA Today’s rally in AI related chipmakers has KLA (KLAC) trading more than 3% higher, as investors position ahead of Nvidia’s earnings and reassess semiconductor equipment exposure tied to artificial intelligence spending. See our latest analysis for KLA. Beyond today’s move, KLA’s recent share price performance has been strong, with a 90 day share price return of 33.44% and a 1 year total shareholder return of 111.02%, indicating strong momentum around AI...",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.35
                    },
                    {
                        "summary": "Stock market today: Dow, S&P 500, Nasdaq futures wobble after Nvidia's big earnings, forecast beats Yahoo Finance",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3364
                    },
                    {
                        "summary": "Artificial intelligence chipmaker Nvidia on Wednesday announced another quarter of astounding quarterly growth as investors try to decipher whether technology's latest craze is overblown hyperbole or a springboard into a new era of prosperity and productivity",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.322
                    },
                    {
                        "summary": "NVIDIA Corporation (NVDA) Q4 2026 Earnings Call Transcript",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3125
                    },
                    {
                        "summary": "Dow futures fall as Nvidia turned lower late despite strong earnings and guidance. The S&P 500 is back above its 50-day line.",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.2136
                    },
                    {
                        "summary": "U.S. futures fell while Asian shares mostly advanced on Thursday after strong-than-expected earnings from chipmaker Nvidia helped ease some investor worries over the artificial intelligence boom. Shares of SoftBank Group, which has a focus on AI technology, were up 3.5%. Chipmaker Tokyo Electron lost 2.8%.",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.1733
                    }
                ],
                "corporate": [
                    {
                        "summary": "AMD Stock Surges On $100 Billion Meta Deal: A Direct Threat To Nvidia EBC Financial Group",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3513
                    },
                    {
                        "summary": "CrowdStrike (NasdaqGS:CRWD), VAST Data, and NVIDIA announced a three-way partnership to secure AI infrastructure and data pipelines end to end. The collaboration combines CrowdStrike's threat detection, VAST Data's data governance, and NVIDIA's AI infrastructure across model training and inference. The agreement focuses on protecting enterprise AI workloads as organizations scale AI deployment and face evolving security risks. For you as an investor, this move places CrowdStrike at the...",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.1489
                    }
                ],
                "management": [
                    {
                        "summary": "Nvidia may have made its immense fortune on the back of specialized graphics processing units (GPUs) used to power artificial intelligence servers, but CEO Jensen Huang is increasingly professing his love for the more generalist CPU. The CPU, or central processing unit, was for ‌decades traditionally viewed as the main brain of a computer - a product most associated with Intel or sometimes Advanced Micro Devices. Huang is fond of saying ‌that where once 90% of computing used to happen on CPUs and 10% on chips like his, the ratio had flipped in recent years.",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.0922
                    }
                ],
                "regulation": [
                    {
                        "summary": "Nvidia Corp. says it secured a license to ship a small number of its less advanced H200 chips to customers in China, inching forward in its bid to return to the world's largest semiconductor market. Bloomberg's Annabelle Droulers reports.",
                        "source": "Yahoo! Finance: NVDA News",
                        "semantic_score": 0.2146
                    }
                ]
            },
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Nvidia earnings smashed expectations as the world’s largest company CEO says AI is only getting better CoinDesk",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.5537
                    },
                    {
                        "summary": "Nvidia Non-GAAP EPS of $1.62 beats by $0.08, revenue of $68.13B beats by $1.9B",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5437
                    },
                    {
                        "summary": "Nvidia Q4 Earnings: Jensen's Half-A-Trillion Dollar Revenue Explosion Starts Today",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5274
                    },
                    {
                        "summary": "Nvidia Stock Jumps on Earnings Beat; Why the Report Excites Wall Street; CEO Jensen Huang to Speak Barron's",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.5258
                    },
                    {
                        "summary": "Nvidia earnings live: Nvidia stock pops as earnings beat, guidance stifles some AI concerns Yahoo Finance",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.5097
                    },
                    {
                        "summary": "Nvidia earnings recap: Stock rises on big beat, Jensen Huang talks OpenAI, space data centers, and more Business Insider",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.5072
                    },
                    {
                        "summary": "Earnings Snapshot: Nvidia posts solid FQ4, guides FQ1 revenue comfortably above estimates",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4967
                    },
                    {
                        "summary": "Earnings call transcript: NVIDIA Q4 2026 beats expectations, stock rises Investing.com",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.4904
                    },
                    {
                        "summary": "Nvidia Beats Wall Street Targets. Stock Edges Higher Investor's Business DailyNvidia: What The Market Still Doesn't Understand Seeking AlphaNvidia stock rises after $78 billion earnings forecast qz.comTech news today: Nvidia earnings on deck as tech stocks rebound, Anthropic relieves some AI fears Yahoo FinanceWhy Nvidia Stock Is Soaring in After-Hours Trading The Motley FoolHow Much Is Nvidia Stock Expected to Move After the AI Chipmaker Reports Earnings? InvestopediaNVIDIA Announces Financial Results for Fourth Quarter and Fiscal 2026 NVIDIA NewsroomNvidia reports earnings and guidance beat as AI boom pushes data center revenue up 75% CNBCNvidia's blowout earnings guidance is met with a shrug. Here's what to know. MarketWatch",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.4872
                    },
                    {
                        "summary": "Nvidia shares drift from earnings momentum as valuation questions emerge",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4567
                    },
                    {
                        "summary": "Nvidia Earnings Live: Chipmaker's Results Blow Past Wall Street Estimates as Customers 'Are Racing to Invest in AI' Investopedia",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.4476
                    },
                    {
                        "summary": "NVDA Earnings: Nvidia Stock Rises after Topping Estimates TipRanks",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.4383
                    },
                    {
                        "summary": "Stock Market News, Feb. 25, 2026: Dow, S&P 500 and Nasdaq secure back-to-back gains as tech stocks advance; Nvidia earnings on tap; gold and silver up. MarketWatch",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.4355
                    },
                    {
                        "summary": "(RTTNews) - NVIDIA Corporation (NVDA) reported earnings for its fourth quarter that Increases, from the same period last year",
                        "source": "NVDA Feed",
                        "semantic_score": 0.4014
                    },
                    {
                        "summary": "Nvidia (NVDA) Earnings Loom as Tech Stocks Face Worst Start Since 2022 Quiver Quantitative",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3976
                    },
                    {
                        "summary": "‘The Collapse of Everything AI’ Could Hinge on Nvidia’s Earnings. What Wall Street Expects from NVDA Stock. Barchart.com",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3955
                    },
                    {
                        "summary": "ETFs heavily tied to Nvidia prepare for potential volatility as earnings loom",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3936
                    },
                    {
                        "summary": "Last Minute Thought: Top Analyst Chimes in on Nvidia Stock as Earnings Loom TipRanks",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3872
                    },
                    {
                        "summary": "Nvidia stock rises into earnings as options market prices rare calm for NVDA TechStock²",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3729
                    },
                    {
                        "summary": "Here's Why Nvidia's Earnings Could Move Your Portfolio Even If You Don't Hold the Stock Investopedia",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3576
                    },
                    {
                        "summary": "NVDA stock $192.85 intraday ahead of Q4 earnings: data center growth to watch Meyka",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3557
                    },
                    {
                        "summary": "Key PointsNvidia just reported fourth-quarter results that were robust by any measure.",
                        "source": "NVDA Feed",
                        "semantic_score": 0.2554
                    },
                    {
                        "summary": "Nvidia pops Q4 results, guidance blow past Wall Street's forecast",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2357
                    },
                    {
                        "summary": "@media (max-width: 768px) { .image-container { width: 100% !important; float: none !important; margin: 0 0 1rem 0 !important; } } Image source: The Mo",
                        "source": "NVDA Feed",
                        "semantic_score": 0.0634
                    }
                ],
                "analyst": [
                    {
                        "summary": "Nvidia: Another Blockbuster Earnings Report (Rating Upgrade)",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4383
                    },
                    {
                        "summary": "Should You Buy Nvidia Stock Before GTC 2026? This Analyst Thinks So. Barchart.com",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.2978
                    },
                    {
                        "summary": "Nvidia: The AI Boom Isn't Slowing, It's Accelerating",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2438
                    }
                ],
                "corporate": [
                    {
                        "summary": "Nvidia declares $0.01 dividend",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1834
                    }
                ],
                "management": [
                    {
                        "summary": "Sandisk stock price steadies near $640 after Citron short call as Nvidia, CEO remarks loom TechStock²",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.2722
                    }
                ],
                "general": [
                    {
                        "summary": "NVDA Stock Hits A New 2026 High Ahead Of Q4 Print — But Fundstrat’s Mark Newton Warns ‘False Breakout’ Could Be Next Stocktwits",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.3173
                    },
                    {
                        "summary": "Wall Street Lunch: Microsoft, Nvidia, Uber Back Wayve's $1.2B Funding",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2833
                    },
                    {
                        "summary": "As Nvidia Launches New AI Laptop Chips, Should You Buy NVDA Stock? Barchart.com",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.2645
                    },
                    {
                        "summary": "4 stocks to watch on Wednesday: NVDA, NFLX, LOW, PYPL Seeking Alpha",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.1993
                    }
                ]
            },
            "2026-02-24": {
                "general": [
                    {
                        "summary": "Expect constructive Q4, outlook and catalysts from Nvidia: Truist",
                        "source": "NVIDIA Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2037
                    }
                ],
                "earnings": [
                    {
                        "summary": "Morgan Stanley resets Nvidia stock forecast ahead of earnings Yahoo Finance",
                        "source": "\"NVDA stock\" - Google News",
                        "semantic_score": 0.2803
                    }
                ]
            }
        }
    },
    "AAPL": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Apple (AAPL) Stock Climbs to $272 on Rebound Momentum, Record Q1 Results and Upcoming iPhone 17e Fuel Optimism International Business Times Australia",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3919
                    },
                    {
                        "summary": "AMZN, AAPL and GOOG Forecasts – Tech Stocks Looking to Continue Upside FXEmpire",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3248
                    },
                    {
                        "summary": "His latest SEC filing reveals that the venture capitalist's hedge fund sold its entire stock portfolio last quarter.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.2764
                    },
                    {
                        "summary": "Vanguard Personalized Indexing Management LLC Acquires 116,960 Shares of Apple Inc. $AAPL MarketBeat",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2596
                    },
                    {
                        "summary": "Samsung Electronics on Thursday launched its flagship Galaxy S26 smartphones with higher prices for some models in the ‌United States and South Korea, testing demand as soaring memory chip costs ‌pressure margins. The rollout, which integrates Perplexity's AI features along with Google's Gemini and an upgraded ​Bixby, follows Samsung's loss of smartphone leadership last year to Apple, which benefited from strong iPhone demand in China and India. A global push by firms such as Meta, Google and Microsoft to build AI infrastructure has absorbed much ⁠of memory supply, lifting prices as chipmakers prioritise higher-margin data centre components such as high-bandwidth memory chips over consumer devices.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.2182
                    },
                    {
                        "summary": "MIAMI, February 25, 2026--Addigy's 2025 results showcase Apple MDM device security and management innovations at scale, plus customer satisfaction outperforming the industry.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.1762
                    }
                ],
                "analyst": [
                    {
                        "summary": "Apple (AAPL) is not an artificial intelligence (AI) winner or loser, but rather an \"AI survivor,\" MoffettNathanson analysts say. BCA Research chief global strategist and director of research Peter Berezin, Yahoo Finance Senior Reporter Brooke DiPalma, and Yahoo Finance Senior Business Reporter Ines Ferré join Opening Bid host Brian Sozzi to discuss Apple's place in the AI race. To watch more expert insights and analysis on the latest market action, check out more Opening Bid.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.2479
                    }
                ],
                "regulation": [
                    {
                        "summary": "ATLANTA, February 25, 2026--Maxio announces Apple Pay support within Maxio Payments, enabling businesses to collect payment faster and more securely.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.2078
                    }
                ],
                "general": [
                    {
                        "summary": "Apple stock rises as AAPL faces UK “backdoor” scrutiny and Spain antitrust heat Bez Kabli",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3103
                    },
                    {
                        "summary": "Apple (AAPL) Stock; Edges Higher as Developers Adjust to Age Verification Rules CoinCentral",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2845
                    },
                    {
                        "summary": "Key PointsApple is expanding its domestic production network.",
                        "source": "AAPL Feed",
                        "semantic_score": 0.2381
                    },
                    {
                        "summary": "Investors vote down request for report on supply chain dependence.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.2226
                    },
                    {
                        "summary": "LONDON, February 25, 2026--RWS Global, the world leader in groundbreaking live moments across entertainment and sports, today announced it has selected Box, Inc. (NYSE: BOX) as its Intelligent Content Management (ICM) partner to help fuel AI-driven content in the company’s experiential ecosystem.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.107
                    }
                ]
            },
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "Assessing Apple (AAPL) Valuation After Record Q1 2026 Earnings AI Plans And Supply Chain Shifts simplywall.st",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.4318
                    },
                    {
                        "summary": "Apple in focus as Morgan Stanley sees App Store revenue growth, Mac strength",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3927
                    },
                    {
                        "summary": "Apple Stock Hits $266.18 Close Amid Q1 Record Earnings and Spring Hardware Buzz International Business Times Australia",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3602
                    },
                    {
                        "summary": "Apple (NASDAQ:AAPL) Stock Price Up 2.2% - What's Next? MarketBeat",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3431
                    },
                    {
                        "summary": "Apple Inc. $AAPL Stock Position Raised by Tufton Capital Management MarketBeat",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2798
                    }
                ],
                "management": [
                    {
                        "summary": "Apple shareholders greenlight executive pay, reject China proposal: report",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2892
                    }
                ],
                "general": [
                    {
                        "summary": "Apple (AAPL) Stock Pops After U.S. Mac Mini Production Shift Wall Street Pit",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2315
                    },
                    {
                        "summary": "Apple to Build Mac Mini in Houston — What It Means for AAPL Investors TipRanks",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2102
                    }
                ]
            },
            "2026-01-29": {
                "earnings": [
                    {
                        "summary": "Big Tech Earnings Live: Apple Beats Wall Street Estimates; Meta Stock Surges, Microsoft Plunges After Results Investopedia",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.5424
                    },
                    {
                        "summary": "Apple Earnings Are Coming – Should You Buy AAPL Stock? TipRanks",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.4285
                    }
                ]
            },
            "2026-02-21": {
                "analyst": [
                    {
                        "summary": "Apple: Why I'm Finally Turning Bullish (Rating Upgrade)",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4596
                    },
                    {
                        "summary": "Apple: Why I'm Finally Turning Bullish (Rating Upgrade) (NASDAQ:AAPL) Seeking Alpha",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.4552
                    }
                ],
                "regulation": [
                    {
                        "summary": "Apple stock (AAPL) ends higher ahead of Monday as tariffs ruling lifts tech; iCloud lawsuit in focus TechStock²",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2848
                    }
                ],
                "general": [
                    {
                        "summary": "Is Apple a potential Mag 7 haven if the AI capex boom becomes a bust?",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2643
                    }
                ]
            },
            "2026-02-18": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Berkshire Hathaway's top holdings: AAPL, AXP, BAC, KO",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.335
                    }
                ],
                "general": [
                    {
                        "summary": "AAPL Stock Jumps 3% as “People see Apple as a Safe Haven” TipRanks",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3471
                    }
                ]
            },
            "2026-02-26": {
                "analyst": [
                    {
                        "summary": "Apple Inc. (AAPL) Moffett Nathanson Raises Price Target The Globe and Mail",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3564
                    }
                ],
                "general": [
                    {
                        "summary": "OpenAI has hired Ruoming Pang, a high-profile AI ‌researcher at Meta, who had joined ‌the company from Apple about seven months ​ago, The Information reported on Wednesday, citing an OpenAI spokesperson. Meta and OpenAI did not immediately respond to Reuters' requests ‌for comment. Pang ⁠oversaw artificial intelligence infrastructure for Meta's Superintelligence Labs, which is ⁠developing the company's next generation of AI models.",
                        "source": "Yahoo! Finance: AAPL News",
                        "semantic_score": 0.1522
                    }
                ]
            },
            "2026-02-12": {
                "analyst": [
                    {
                        "summary": "Top analyst revamps Apple stock price target thestreet.com",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.5047
                    }
                ]
            },
            "2026-02-19": {
                "corporate": [
                    {
                        "summary": "Coming soon: IMAX to show F1 races in U.S. theaters under new deal with Apple TV",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1132
                    }
                ],
                "general": [
                    {
                        "summary": "Apple (AAPL) is a Top-Ranked Growth Stock: Should You Buy? Nasdaq",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3912
                    },
                    {
                        "summary": "As Apple Tests AI Devices, Should You Buy AAPL Stock Here? Barchart.com",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2771
                    }
                ]
            },
            "2026-02-23": {
                "regulation": [
                    {
                        "summary": "Apple Stock: Is AAPL Underperforming the Technology Sector? Barchart.com",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3802
                    }
                ],
                "general": [
                    {
                        "summary": "9 Stocks Charlie Munger's Money Manager Loves - Apple (NASDAQ:AAPL), Bank of America (NYSE:BAC) Benzinga",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2975
                    },
                    {
                        "summary": "Apple stock dips before market open as tariff whiplash returns; AAPL events line up TechStock²",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2917
                    },
                    {
                        "summary": "Wedbush Maintains Bullish View on Apple (AAPL) despite AI Delay Concerns Yahoo Finance",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2581
                    },
                    {
                        "summary": "Apple Stock (AAPL) Opinions on AI Wearables Development Quiver Quantitative",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.1887
                    }
                ]
            },
            "2026-02-20": {
                "general": [
                    {
                        "summary": "‘This Time It’s Different,’ Says Daniel Ives About Apple Stock (AAPL) TipRanks",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2857
                    },
                    {
                        "summary": "Memory crunch looms over hardware makers, but Apple receives bullish sentiment: Evercore",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2004
                    }
                ],
                "analyst": [
                    {
                        "summary": "Apple: Margin Pressure And Lack Of Innovation (Rating Downgrade)",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3206
                    }
                ]
            },
            "2026-02-13": {
                "general": [
                    {
                        "summary": "Why Is Apple (AAPL) Stock Falling? INDmoney",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2919
                    }
                ]
            },
            "2026-02-02": {
                "analyst": [
                    {
                        "summary": "Apple 'Selling Its Soul To The Devil'? Analyst Says Partnering With Alphabet Limits AI Upside Yahoo Finance",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.2937
                    }
                ]
            },
            "2026-02-04": {
                "general": [
                    {
                        "summary": "Apple stock jumps as Goldman flags App Store spending pickup, keeping AAPL in focus TechStock²",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3075
                    }
                ]
            },
            "2026-01-30": {
                "earnings": [
                    {
                        "summary": "Apple tops Q1 earnings estimates on record-breaking iPhone sales; stock falls after Cook's memory warning Yahoo Finance",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.3395
                    }
                ],
                "general": [
                    {
                        "summary": "AAPL Stock Slides Despite Record iPhone Sales, Bull Notes Schaeffer's Investment Research",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.4041
                    }
                ]
            },
            "2026-01-28": {
                "earnings": [
                    {
                        "summary": "Here's How Much Traders Expect Apple Stock to Move After Earnings Thursday Investopedia",
                        "source": "\"AAPL stock\" - Google News",
                        "semantic_score": 0.4045
                    }
                ]
            },
            "2026-02-22": {
                "general": [
                    {
                        "summary": "Apple Obliterated Tariff Headwinds - The Supreme Court Decision Doesn't Matter",
                        "source": "Apple Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4043
                    }
                ]
            }
        }
    },
    "AMD": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-26": {
                "earnings": [
                    {
                        "summary": "Advanced Micro Devices (AMD) stock has lost about 18% in the past month, at the time of writing, Wednesday afternoon, Feb. 25, according to Yahoo Finance. Meanwhile, the SPDR S&P 500 index (SPY) is up about 0.4% in the same period. The stock crashed following its Q4 earnings report on February ...",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.2655
                    }
                ],
                "corporate": [
                    {
                        "summary": "AMD Stock Surges On $100 Billion Meta Deal: A Direct Threat To Nvidia EBC Financial Group",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3513
                    },
                    {
                        "summary": "Advanced Micro Devices (NasdaqGS:AMD) and Meta Platforms have agreed a multi-year, multi-billion dollar AI chip and infrastructure partnership. The deal covers up to six gigawatts of customized AI compute for Meta's data centers. Meta may acquire up to a 10% equity stake in AMD through performance-based warrants tied to the partnership. For AMD, a major supplier of CPUs and GPUs, this agreement connects the company directly to one of the largest AI infrastructure buildouts currently...",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.2429
                    },
                    {
                        "summary": "Meta’s Massive AMD AI Deal Recasts Spending, Suppliers And Future Returns simplywall.st",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2168
                    }
                ],
                "management": [
                    {
                        "summary": "Nvidia may have made its immense fortune on the back of specialized graphics processing units (GPUs) used to power artificial intelligence servers, but CEO Jensen Huang is increasingly professing his love for the more generalist CPU. The CPU, or central processing unit, was for ‌decades traditionally viewed as the main brain of a computer - a product most associated with Intel or sometimes Advanced Micro Devices. Huang is fond of saying ‌that where once 90% of computing used to happen on CPUs and 10% on chips like his, the ratio had flipped in recent years.",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.0922
                    }
                ],
                "general": [
                    {
                        "summary": "On Monday, Cathie Wood-led Ark Invest executed significant trades across its ETFs, focusing on companies like Figma Inc. (NYSE:FIG) , DoorDash Inc. (NASDAQ:DASH), and Advanced Micro Devices Inc. (NASDAQ:AMD). The Wood-led company also transacted in the shares of BWX Technologies Inc. (NYSE:BWXT), Alphabet Inc. (NASDAQ:GOOG) and Taiwan Semiconductor Manufacturing Co. Ltd. (NYSE:TSM) The Figma Trade Ark Invest made a substantial purchase of Figma shares, acquiring 380,126 shares through its ARK In",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.3432
                    }
                ]
            },
            "2026-02-09": {
                "earnings": [
                    {
                        "summary": "AMD: Why I'm Buying Post-Earnings",
                        "source": "Advanced Micro Devices, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4999
                    }
                ]
            },
            "2026-02-04": {
                "earnings": [
                    {
                        "summary": "AMD stock sinks 17% after earnings. Here's why CNBC",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.4223
                    },
                    {
                        "summary": "AMD stock plummets despite Q4 earnings beat Yahoo Finance",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3862
                    },
                    {
                        "summary": "AMD falls 17%, posts worst day since 2017 as Lisa Su addresses guidance concerns CNBC",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2935
                    }
                ]
            },
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "Nvidia Stock Reacts After AMD, Meta Deal. Why Wall Street Is Bullish Ahead of Earnings. Barron's",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.4108
                    },
                    {
                        "summary": "Meta stock slips as AMD AI chip pact puts spending back in focus ahead of Nvidia earnings TechStock²",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2801
                    }
                ],
                "corporate": [
                    {
                        "summary": "AMD stock surges 14% on Meta AI partnership deal Investing.com",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.394
                    },
                    {
                        "summary": "AMD Stock Rises On Meta AI Infrastructure Deal Investor's Business Daily",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3459
                    },
                    {
                        "summary": "AMD Stock Surges After AI Chip Maker Agrees to Meta Deal. It's a Big Win. Barron'sAMD Just Won Another Massive AI Chip Deal. Its Stock Is Soaring. InvestopediaIs AMD Stock Going to $300 After the Meta Platforms Deal? The Motley Fool",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.339
                    },
                    {
                        "summary": "AMD stock gains after securing major Meta supply deal, Mizuho’s Klein Comments Investing.com",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3269
                    },
                    {
                        "summary": "Meta agrees multibillion-dollar chip deal with AMD Financial Times",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2968
                    },
                    {
                        "summary": "AMD clinches second mega chip supply deal, this time with Meta Reuters",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2875
                    },
                    {
                        "summary": "Meta and AMD announce 6-gigawatt GPU deal as part of AI build-out, AMD stock jumps Yahoo Finance",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2779
                    },
                    {
                        "summary": "AMD’s stock rockets as Meta deal serves as major validation point for investors MarketWatch",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2674
                    },
                    {
                        "summary": "Advanced Micro Devices (NASDAQ:AMD), a designer of microprocessors and GPUs for computing and graphics, closed Tuesday at $213.84, up 8.77%. The stock is jumping after news of a massive multiyear AI chip and systems deal with Meta Platforms (NASDAQ:META), and investors are watchi",
                        "source": "AMD Feed",
                        "semantic_score": 0.2611
                    },
                    {
                        "summary": "Networking, AI stocks jump on back of AMD-Meta megadeal",
                        "source": "Advanced Micro Devices, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2505
                    },
                    {
                        "summary": "Advanced Micro Devices, Inc. (AMD) Discusses Expanded AI Partnership with Meta and Multi-Year GPU Deployment Agreement Transcript",
                        "source": "Advanced Micro Devices, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2113
                    }
                ],
                "management": [
                    {
                        "summary": "AMD CEO Says Meta Stock Deal Ties Company to a Market Leader WSJ",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3772
                    },
                    {
                        "summary": "AMD Stock Jumped Today. CEO Lisa Su Doesn't Think AI Will 'Replace Everything' Investopedia",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3291
                    }
                ]
            },
            "2026-02-25": {
                "analyst": [
                    {
                        "summary": "SA analyst upgrades/downgrades: AMD, NBIS, GM, CRWD",
                        "source": "Advanced Micro Devices, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3916
                    },
                    {
                        "summary": "Buy Into an Emerging AI Infrastructure Leader, Says Top Analyst About AMD Stock Following Meta Deal TipRanks",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3754
                    },
                    {
                        "summary": "TD Cowen reiterates AMD stock Buy rating on Meta partnership Investing.com",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3657
                    },
                    {
                        "summary": "AMD Stock in Focus after Meta’s $100B Deal – Analysts Call it a ‘Major Milestone’ TipRanks",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3527
                    },
                    {
                        "summary": "Bank of America reiterated its ‘Buy’ ratings on both Meta Platforms Inc (NASDAQ:META, XETRA:FB2A, SIX:FB) and Advanced Micro Devices Inc (NASDAQ:AMD, XETRA:AMD) following their newly announced multi-year AI infrastructure agreement, arguing the deal strengthens long-term positioning for both...",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.3368
                    }
                ],
                "corporate": [
                    {
                        "summary": "AMD to Buy $150 Million of Nutanix Stock in New Partnership Bloomberg.com",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3889
                    },
                    {
                        "summary": "Is AMD Stock Going to $300 After the Meta Platforms Deal? Yahoo Finance",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2933
                    },
                    {
                        "summary": "Advanced Micro Devices' (AMD) recently announced multiyear artificial intelligence chips partnership",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.2932
                    },
                    {
                        "summary": "Stock Market News, Feb. 24, 2026: Dow Rises; AMD Rallies After Meta Deal WSJ",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2787
                    },
                    {
                        "summary": "AMD Stock (+8.8%) : Landmark Meta AI Chip Deal Ignites Institutional Chase Trefis",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.277
                    },
                    {
                        "summary": "AMD Stock Today: Meta $60B AI Deal, 10% Warrant Lifts Outlook — February 26 Meyka",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2527
                    },
                    {
                        "summary": "Meta Platforms (NasdaqGS:META) has agreed a multi year AI chip deal with AMD that includes purchasing over 6 gigawatts of GPUs. The agreement is valued at up to US$100b and includes warrants for Meta to acquire up to 160 million AMD shares, potentially giving Meta a 10% equity stake. The structure links Meta’s future AMD share ownership to performance milestones tied to the AI hardware rollout. Meta, which runs Facebook, Instagram, WhatsApp and its broader metaverse and AI efforts, is...",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.2298
                    },
                    {
                        "summary": "AMD’s expanded partnership with Meta strengthens its competitive position in the global AI buildouts.",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.2225
                    },
                    {
                        "summary": "News Highlights AMD and Nutanix sign multi-year agreement to accelerate adoption of Nutanix-powered agentic AI platform on AMD accelerated compute infrastructure for enterprise AI and service providers AMD to invest and fund up to $250 million in Nutanix shares, and R&D and go-to-market for integrated solutions Joint roadmap to integrate AMD ROCm™ and AMD Enterprise AI software into the Nutanix Cloud Platform and the Nutanix Kubernetes Platform using AMD EPYC™ CPUs and AMD Instinct™ GPUs with su",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.1997
                    }
                ],
                "regulation": [
                    {
                        "summary": "AMD: Meta Agrees to Be the Firm’s Second Large AI Customer Morningstar Canada",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.1948
                    }
                ],
                "general": [
                    {
                        "summary": "YieldMax AMD Option Income Strategy ETF (NYSEARCA:AMDY) attracts income-focused investors with an eye-catching advertised yield, but the mechanics behind that income stream deserve careful scrutiny before treating it as reliable. How AMDY Generates Income AMDY does not hold shares of Advanced Micro Devices (NASDAQ:AMD) directly. Instead, it runs a synthetic covered call strategy, using options ... The Eye-Catching Yield on This AMD Options ETF Comes With a Serious Catch",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.3112
                    },
                    {
                        "summary": "Nutanix Stock Rips Higher After $150 Million AMD Equity Investment Benzinga",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3058
                    },
                    {
                        "summary": "AMD stock rises in premarket as Meta AI-chip pact puts 160 million-share warrant under a microscope TechStock²",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2839
                    }
                ],
                "earnings": [
                    {
                        "summary": "Cracking the Chip Monopoly: Meta Invests in AMD Chips MarketBeat",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2787
                    },
                    {
                        "summary": "Piper Sandler keeps AMD stock Overweight on Meta AI chip deal Investing.com",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.2377
                    },
                    {
                        "summary": "Piper Sandler sees transformational upside from multi-year AI chip pact.",
                        "source": "Yahoo! Finance: AMD News",
                        "semantic_score": 0.1622
                    }
                ]
            },
            "2026-02-20": {
                "analyst": [
                    {
                        "summary": "AMD's Pullback Won't Last Long (Rating Upgrade)",
                        "source": "Advanced Micro Devices, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4057
                    }
                ]
            },
            "2026-02-23": {
                "general": [
                    {
                        "summary": "Is Advanced Micro Devices (AMD) Still Attractively Priced After Recent Share Price Pullback? Yahoo Finance",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.3409
                    }
                ]
            },
            "2026-02-03": {
                "earnings": [
                    {
                        "summary": "AMD shares drop as forecast comes up short of some expectations CNBC",
                        "source": "\"AMD stock\" - Google News",
                        "semantic_score": 0.238
                    }
                ]
            },
            "2026-02-08": {
                "earnings": [
                    {
                        "summary": "AMD Q4 Earnings: 3 Reasons For The Knife To Fall More",
                        "source": "Advanced Micro Devices, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.314
                    }
                ]
            }
        }
    },
    "AMZN": {
        "news_count": 43,
        "30_day_news": {
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Becoming the world’s top revenue generator strengthens Amazon’s story, yet heavy AI capex keeps valuation risks in focus.",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.3798
                    },
                    {
                        "summary": "Amazon.com Inc (NASDAQ:AMZN)’s cloud unit, AWS, could see revenue growth above Street expectations thanks to significant capacity expansion, according to Bank of America analysts. “Based on capex disclosures and AWS commentary, we estimate AWS will add approximately 15 gigawatts of capacity...",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.3433
                    },
                    {
                        "summary": "AMZN, AAPL and GOOG Forecasts – Tech Stocks Looking to Continue Upside FXEmpire",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3248
                    },
                    {
                        "summary": "Anthropic accused three Chinese AI companies of running 24,000 fraudulent accounts to siphon capabilities from its Claude chatbot, in what may be the largest documented case of AI model theft to date. DeepSeek, Moonshot AI and MiniMax generated over 16 million exchanges with Claude, violating terms of service and geographic access restrictions. The labs used a technique called distillation, where a weaker model trains on the outputs of a stronger one, to extract Claude’s most advanced reasoning,",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.2368
                    },
                    {
                        "summary": "On Monday, xAI CEO Elon Musk escalated his feud after Amazon.com, Inc. (NASDAQ:AMZN)-backed Anthropic accused Chinese firms like DeepSeek of copying its Claude model. Anthropic Alleges ‘Industrial-Scale' AI Distillation Anthropic said that Chinese AI companies, including DeepSeek, Moonshot AI and MiniMax, orchestrated what it described as \"industrial-scale\" distillation attacks on its Claude model. We've identified industrial-scale distillation attacks on our models by DeepSeek, Moonshot AI, and",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.2036
                    },
                    {
                        "summary": "Much has been made of AI cloud giants like Amazon.com, Microsoft, and Alphabet extending their depreciation schedules on AI servers from four years to six years, saving on cost-of-revenue in the near term.",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.1807
                    }
                ],
                "management": [
                    {
                        "summary": "Amazon’s CEO Garman of web services sells $3.6m in AMZN stock Investing.com",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3548
                    },
                    {
                        "summary": "Amazon’s CEO Herrington sells $1.4m in AMZN stock By Investing.com Investing.com South Africa",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3084
                    },
                    {
                        "summary": "SpaceX CEO Elon Musk says that the company's satellite internet service, Starlink, is targeting a broader customer base with its latest move. Starlink To Offer Free Hardware In a post on the social media platform X on Monday, a handle called X Daily News posted that the satellite internet service provider was \"aggressively cutting prices and giving free hardware to distribution partners,\" also adding that Starlink's move could be in response to Amazon.com Inc.'s (NASDAQ:AMZN) Kuiper's (Amazon Le",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.2512
                    }
                ],
                "general": [
                    {
                        "summary": "Amazon (AMZN)’s Doing Better Than People Think, Says Jim Cramer Yahoo Finance",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.4228
                    },
                    {
                        "summary": "Assessing Amazon (AMZN) Valuation After Recent Share Price Swings simplywall.st",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3414
                    },
                    {
                        "summary": "Amazon stock price today: AMZN ends higher as AI trade steadies, antitrust and exec exits linger TechStock²",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2992
                    },
                    {
                        "summary": "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares MSCI ACWI ETF (Symbol: ACWI) where we have detected an approximate $235.7 million dollar inflow -- that's a 0.8% increase week over week in o",
                        "source": "AMZN Feed",
                        "semantic_score": 0.2716
                    },
                    {
                        "summary": "Representatives of firms including Amazon.com Inc., Meta Platforms Inc., Microsoft Corp. and Google parent Alphabet Inc. are expected to attend a March 4 event with the president, a White House official said. Others on the invite list include Elon Musk’s xAI Corp., Oracle Corp. and OpenAI Inc.",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.1872
                    }
                ]
            },
            "2026-02-06": {
                "earnings": [
                    {
                        "summary": "AMZN Stock Down 8% after Earnings — What Spooked Investors TipRanks",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.4236
                    }
                ],
                "general": [
                    {
                        "summary": "Why Amazon (AMZN) Stock Is Down Today Yahoo Finance",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2444
                    }
                ]
            },
            "2026-02-03": {
                "earnings": [
                    {
                        "summary": "Can Amazon’s Q4 Earnings Report Push AMZN Stock Higher? Yahoo Finance",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.4962
                    }
                ],
                "analyst": [
                    {
                        "summary": "Analysts reset Amazon stock price target before earnings | AMZN thestreet.com",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.4655
                    }
                ],
                "general": [
                    {
                        "summary": "Is It Time To Reconsider Amazon.com (AMZN) After Strong Multi Year Share Price Gains Yahoo Finance",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3989
                    }
                ]
            },
            "2026-02-02": {
                "earnings": [
                    {
                        "summary": "Amazon Stock Is Cheap Heading Into Q4 Earnings (NASDAQ:AMZN) Seeking Alpha",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3431
                    }
                ]
            },
            "2026-02-04": {
                "earnings": [
                    {
                        "summary": "Amazon’s Q4 Earnings Could Impress: Should You Buy, Sell, or Hold AMZN Stock? Yahoo Finance",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.4172
                    }
                ]
            },
            "2026-02-11": {
                "analyst": [
                    {
                        "summary": "AMZN Stock Falls -15% With A 6-day Losing Spree On Analyst Downgrade To $175 Trefis",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2931
                    }
                ]
            },
            "2026-02-19": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Coatue Management's top holdings: TSM, MSFT, META, AMZN",
                        "source": "Amazon.com, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3017
                    }
                ],
                "general": [
                    {
                        "summary": "Big Money Sees Big Value in Amazon: Should You Buy AMZN Stock Too? Yahoo Finance",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3878
                    }
                ]
            },
            "2026-02-18": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Bill Ackman’s Pershing Square Q4 holdings: BN, UBER, AMZN, GOOG, META",
                        "source": "Amazon.com, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2885
                    }
                ],
                "filing": [
                    {
                        "summary": "Quant check on Eminence Capital's top Q4 holdings: AMZN, GTLB, AMD, LPX",
                        "source": "Amazon.com, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2784
                    },
                    {
                        "summary": "Quant check on Dan Loeb-led Third Point's top Q4 holdings: PCG, NVDA, UNP, AMZN",
                        "source": "Amazon.com, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1995
                    }
                ]
            },
            "2026-02-24": {
                "corporate": [
                    {
                        "summary": "How Amazon’s Bath & Body Works Deal And US$200 Billion AI Spend At Amazon.com (AMZN) Has Changed Its Investment Story simplywall.st",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2544
                    }
                ],
                "management": [
                    {
                        "summary": "Amazon CEO Jassy sells $4.08 million in AMZN stock Investing.com",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3398
                    }
                ],
                "general": [
                    {
                        "summary": "Goldman Says Capital-Heavy Stocks Are Winning As AMZN, ORCL, MSFT, META Gear Up For $1.5 Trillion AI Spending Wave: Report Stocktwits",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3886
                    },
                    {
                        "summary": "Amazon (AMZN) Stock Rebounds Slightly After Sharp Sell-Off on Heavy AI Spending Concerns, Trades Near $205 International Business Times Australia",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2958
                    },
                    {
                        "summary": "Amazon (AMZN) Stock: AI Infrastructure & Bullish Options Trade for 2026 National Today",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2764
                    },
                    {
                        "summary": "Amazon (AMZN) Stock to Invest $12 Billion in Louisiana Data Centers CoinCentral",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2595
                    }
                ]
            },
            "2026-02-14": {
                "management": [
                    {
                        "summary": "Amazon CEO Herrington sells $208k in AMZN stock Investing.com",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3846
                    }
                ],
                "general": [
                    {
                        "summary": "AMZN Stock Falls -18% With A 9-day Losing Spree On AI Capex Shock Trefis",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.2896
                    }
                ]
            },
            "2026-02-05": {
                "general": [
                    {
                        "summary": "Why Amazon (AMZN) Shares Are Falling Today Yahoo Finance",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3311
                    }
                ]
            },
            "2026-02-23": {
                "earnings": [
                    {
                        "summary": "Amazon (AMZN) Stock Overtakes Walmart (WMT) as America's Biggest Company by Revenue CoinCentral",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.4212
                    }
                ],
                "general": [
                    {
                        "summary": "Amazon (AMZN) Stock: How the Company Finally Knocked Walmart Off America's Top Spot After 25 Years Blockonomi",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3863
                    }
                ]
            },
            "2026-02-21": {
                "earnings": [
                    {
                        "summary": "Amazon stock jumps on tariff court shock; AWS outage report keeps AMZN in focus next week TechStock²",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3184
                    }
                ]
            },
            "2026-02-26": {
                "earnings": [
                    {
                        "summary": "Amazon.com (NasdaqGS:AMZN) has surpassed Walmart to become the largest U.S. company by annual revenue, taking the top spot on the Fortune 500. At the same time, AI research leader David Luan is departing, with Peter Desantis stepping in to oversee Amazon’s AI research efforts. These developments coincide with Amazon’s move to integrate its AGI division more closely with AWS. For investors watching Amazon.com at a share price of $210.63, this revenue milestone highlights how far the company...",
                        "source": "Yahoo! Finance: AMZN News",
                        "semantic_score": 0.3769
                    }
                ]
            },
            "2026-02-17": {
                "general": [
                    {
                        "summary": "Coatue expands positions in NFLX, AMZN and cuts in GOOGL, META, among other Q4 moves",
                        "source": "Amazon.com, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1256
                    }
                ]
            },
            "2026-02-20": {
                "general": [
                    {
                        "summary": "Amazon Stock Still Makes No Sense (NASDAQ:AMZN) Seeking Alpha",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.261
                    }
                ]
            },
            "2026-02-12": {
                "general": [
                    {
                        "summary": "Here Are The Catalysts AMZN Stock Bulls Are Waiting For Forbes",
                        "source": "\"AMZN stock\" - Google News",
                        "semantic_score": 0.3469
                    }
                ]
            }
        }
    },
    "MSFT": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-20": {
                "earnings": [
                    {
                        "summary": "Microsoft stock forecast: Could AI strategy influence MSFT outlook? Capital.com",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3117
                    }
                ]
            },
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Microsoft Stock (MSFT) Opinions on Fiscal Q2 Earnings Quiver Quantitative",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4437
                    },
                    {
                        "summary": "Microsoft Corporation $MSFT Shares Bought by Fidelis Capital Partners LLC MarketBeat",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4298
                    },
                    {
                        "summary": "Microsoft Corporation $MSFT Shares Acquired by one8zero8 LLC MarketBeat",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3826
                    },
                    {
                        "summary": "STORY: U.S. stocks ended higher on Wednesday, with the Dow gaining about six-tenths of a percent, the S&P 500 adding eight-tenths of a percent and the tech-heavy Nasdaq climbing roughly one-and-a-quarter percent.The tech-led rally came as markets near the end of a tumultuous month marked by concerns over massive AI spending and disruption among software and other companies.Brian Mulberry is chief market strategist at Zacks Investment Management.“We're seeing a little bit of a recovery in the software stocks leading the Nasdaq a little bit higher. I think we've kind of gotten to a realization that software isn't dead, and that's evidenced by a deal that was announced yesterday, Anthropic actually working directly with Microsoft, giving them 10 new plug-ins to some of their programming that Microsoft can then use in their agentic platform on the Azure cloud business.”Stocks on the move Wednesday included AI powerhouse Nvidia, whose quarterly results have become a focal point for investors. Shares of the chipmaker closed almost a percent and a half higher and climbed further in extended trading after the company forecast first-quarter revenue above market estimates.Other movers included taser-maker Axon Enterprise, which jumped more than 17% after the company beat fourth-quarter profit estimates.On the flip side, shares of GoDaddy tumbled more than 14% after the internet services provider forecast annual revenue below Wall Street expectations.",
                        "source": "Yahoo! Finance: MSFT News",
                        "semantic_score": 0.3639
                    },
                    {
                        "summary": "Goldman Sachs resets Microsoft stock forecast thestreet.comMicrosoft (NASDAQ:MSFT) Shares Up 3% - Here's Why MarketBeatIs MSFT Stock Vulnerable to Rising Capex Pressure From AI Spending? Zacks Investment ResearchMicrosoft Stock Climbs After AI Fears Ease on Anthropic's Comments TradingViewMicrosoft Is In A Bear Market, Which Is Creating A Major Opportunity (NASDAQ:MSFT) Seeking Alpha‘Look to History,’ Says Top Investor About Microsoft Stock TipRanksMicrosoft (MSFT) Needs a Refresh, Says Jim Cramer Yahoo FinanceMicrosoft’s Impossible Situation (NASDAQ:MSFT) Seeking AlphaWhy Citi Analysts Think You Should Buy Microsoft Stock Now Yahoo Finance",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3547
                    },
                    {
                        "summary": "Microsoft Corporation $MSFT Shares Purchased by TD Waterhouse Canada Inc. MarketBeat",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3539
                    },
                    {
                        "summary": "Microsoft Corporation $MSFT Shares Sold by Stack Financial Management Inc MarketBeat",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3389
                    },
                    {
                        "summary": "Microsoft stock price rebounds as Japan raids Azure unit; MSFT investors eye Nvidia earnings TechStock²",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3
                    },
                    {
                        "summary": "Great Lakes Advisors LLC Sells 3,897 Shares of Microsoft Corporation $MSFT MarketBeat",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2969
                    },
                    {
                        "summary": "Flossbach Von Storch SE Sells 9,319 Shares of Microsoft Corporation $MSFT MarketBeat",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.282
                    },
                    {
                        "summary": "Zoom is ​increasingly squeezed by rivals such as Microsoft's Teams and Alphabet's Google Meet, which come bundled with broader workplace suites that often make them cheaper for enterprise customers. Despite a push to diversify ‌its offerings, Zoom ⁠has been grappling with slowing growth as pandemic-era work-from-home arrangements decline and employees return to offices. While ⁠its enterprise business has shown resilience, the online segment, which serves individual consumers and small businesses, has remained a weak spot.",
                        "source": "Yahoo! Finance: MSFT News",
                        "semantic_score": 0.1957
                    }
                ],
                "corporate": [
                    {
                        "summary": "MSFT Stock Forms Support on US Govt Cloud Protection and SpaceX Deal - Is the Worst Over? FXLeaders",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2198
                    },
                    {
                        "summary": "ADBE expands AI partnerships and embeds Firefly and Acrobat AI to revive growth as shares slide 27% YTD amid fierce Microsoft and Alphabet rivalry.",
                        "source": "MSFT Feed",
                        "semantic_score": 0.1987
                    }
                ],
                "general": [
                    {
                        "summary": "Microsoft (MSFT) Stock; Rises on Kenya Connectivity Push With Starlink CoinCentral",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2839
                    },
                    {
                        "summary": "Microsoft Stock: Is MSFT Overvalued After Momentum Fades? Eudaimonia and Co",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2695
                    },
                    {
                        "summary": "Microsoft Stock (MSFT) Jumps as Xbox CCO Confirms ‘There Are No Directives on AI Coming Down’ TipRanks",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2572
                    }
                ]
            },
            "2026-01-30": {
                "analyst": [
                    {
                        "summary": "Microsoft: The Earnings Drawdown Is A Gift (Rating Upgrade) (NASDAQ:MSFT) Seeking Alpha",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4708
                    }
                ],
                "general": [
                    {
                        "summary": "Microsoft Stock (MSFT) Plunges 10% — But Here’s What Crowd Wisdom Shows TipRanks",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3068
                    }
                ]
            },
            "2026-02-17": {
                "analyst": [
                    {
                        "summary": "Melius Research Downgrades Microsoft Corporation (MSFT) Stock to Hold Yahoo Finance",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2783
                    }
                ],
                "general": [
                    {
                        "summary": "As Microsoft Bets on ‘True Self-Sufficiency,’ Should You Bet on MSFT Stock? Barchart.com",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2998
                    }
                ]
            },
            "2026-02-03": {
                "analyst": [
                    {
                        "summary": "Microsoft: Pullback Improves The Investment Case (Rating Upgrade) (NASDAQ:MSFT) Seeking Alpha",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.5081
                    }
                ]
            },
            "2026-02-24": {
                "analyst": [
                    {
                        "summary": "Microsoft (MSFT) Stock: Citi and Goldman Sachs Reiterate Buy Ratings – Here’s Why Blockonomi",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4152
                    }
                ],
                "corporate": [
                    {
                        "summary": "Microsoft Stock Ticks Up as OpenAI Deals Keep Azure on Track GuruFocus",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3237
                    }
                ],
                "management": [
                    {
                        "summary": "Microsoft Stock (MSFT) Up on Reports that Xbox Employees are Pleased with Leadership Changes TipRanks",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3361
                    }
                ],
                "regulation": [
                    {
                        "summary": "Microsoft (MSFT) Deep Dive: Navigating the AI Diffusion Era Amidst a Sector Selloff FinancialContent",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.252
                    }
                ],
                "general": [
                    {
                        "summary": "Assessing Microsoft (MSFT) Valuation After Recent Pullback And Fading Share Price Momentum simplywall.st",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3364
                    },
                    {
                        "summary": "Microsoft (MSFT) Stock: Citi and Goldman Still See 50% Upside – Time to Buy? CoinCentral",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3112
                    },
                    {
                        "summary": "Microsoft stock steadies near $385 as AI spending worries set the tone for MSFT TechStock²",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2876
                    },
                    {
                        "summary": "March 11th Options Now Available For Microsoft (MSFT) Nasdaq",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2641
                    },
                    {
                        "summary": "Microsoft (MSFT) Stock Closes at $428.15 as Cloud and AI Momentum Offsets Broader Tech Caution International Business Times Australia",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2561
                    }
                ]
            },
            "2026-02-02": {
                "analyst": [
                    {
                        "summary": "Microsoft: At $430/Share, It’s Time To Be Greedy (Rating Upgrade) (NASDAQ:MSFT) Seeking Alpha",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4854
                    }
                ],
                "general": [
                    {
                        "summary": "Shorting Microsoft Puts Looks Very Attractive to Value Investors in MSFT Stock Barchart.com",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2155
                    }
                ]
            },
            "2026-02-23": {
                "corporate": [
                    {
                        "summary": "Microsoft (MSFT) Stock Is Down 25% – Here’s the OpenAI Deal That Could Change Things CoinCentral",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2816
                    }
                ],
                "management": [
                    {
                        "summary": "Microsoft Stock (MSFT) Slips on Departure of Gaming CEO Phil Spencer TipRanks",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4156
                    }
                ],
                "general": [
                    {
                        "summary": "Maia 200 Gives Microsoft Stock (NASDAQ:MSFT) a Boost With Goldman Sachs, But Nowhere Else TipRanks",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.288
                    }
                ]
            },
            "2026-02-18": {
                "corporate": [
                    {
                        "summary": "Microsoft, CrowdStrike expand deal to allow all customers Falcon on Microsoft Marketplace access",
                        "source": "Microsoft Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2994
                    }
                ],
                "earnings": [
                    {
                        "summary": "Microsoft set to receive 20% of total OpenAI revenue until 2032: report",
                        "source": "Microsoft Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3844
                    }
                ]
            },
            "2026-02-09": {
                "general": [
                    {
                        "summary": "Microsoft (MSFT) Stock Trades Up, Here Is Why Yahoo Finance",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2867
                    }
                ]
            },
            "2026-01-29": {
                "general": [
                    {
                        "summary": "Why Microsoft (MSFT) Shares Are Falling Today Yahoo Finance",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3317
                    },
                    {
                        "summary": "Microsoft (NASDAQ: MSFT) Stock Price Prediction for 2026: Where Will It Be in 1 Year 24/7 Wall St.",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2607
                    }
                ],
                "earnings": [
                    {
                        "summary": "Microsoft Shares Dive as Data-Center Spending Overshadows Earnings Surge WSJ",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4451
                    },
                    {
                        "summary": "Microsoft Drops After Earnings—Why the Bull Case Holds MarketBeat",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.4413
                    },
                    {
                        "summary": "Microsoft: This Is An Earnings Dip You Want To Buy (NASDAQ:MSFT) Seeking Alpha",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.3975
                    }
                ]
            },
            "2026-01-28": {
                "earnings": [
                    {
                        "summary": "Microsoft stumbles even as Q2 results top estimates (MSFT:NASDAQ) Seeking Alpha",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2916
                    }
                ]
            },
            "2026-02-19": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Coatue Management's top holdings: TSM, MSFT, META, AMZN",
                        "source": "Microsoft Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3017
                    }
                ],
                "earnings": [
                    {
                        "summary": "Microsoft: This AI Selloff Could Be The Buying Opportunity Investors Miss",
                        "source": "Microsoft Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3029
                    }
                ]
            },
            "2026-02-01": {
                "general": [
                    {
                        "summary": "2 Monster Stocks to Hold for the Next 20 Years -- Including Microsoft (MSFT) Stock The Motley Fool",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2624
                    }
                ]
            },
            "2026-02-05": {
                "general": [
                    {
                        "summary": "Microsoft: It Is Just A Dip, Not A Bargain (NASDAQ:MSFT) Seeking Alpha",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2906
                    }
                ]
            },
            "2026-02-22": {
                "general": [
                    {
                        "summary": "Why Microsoft (MSFT) stock is on the brink of collapse Finbold",
                        "source": "\"MSFT stock\" - Google News",
                        "semantic_score": 0.2705
                    }
                ]
            }
        }
    },
    "GOOGL": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Alphabet (GOOGL) Stock Steady Near $311 as AI Investments Surge Post-Q4 2025 Earnings Beat International Business Times Australia",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.4362
                    },
                    {
                        "summary": "SVB Wealth LLC Sells 14,342 Shares of Alphabet Inc. $GOOGL MarketBeat",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.335
                    },
                    {
                        "summary": "Alphabet Inc. $GOOGL Stock Holdings Increased by Rockland Trust Co. MarketBeat",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3116
                    },
                    {
                        "summary": "Alphabet Inc. $GOOGL Shares Sold by Versor Investments LP MarketBeat",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3081
                    },
                    {
                        "summary": "Midwest Trust Co Cuts Stock Position in Alphabet Inc. $GOOGL MarketBeat",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2934
                    },
                    {
                        "summary": "Alphabet Inc. $GOOGL Shares Sold by General Pension Society PZU Joint Stock Co MarketBeat",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2827
                    },
                    {
                        "summary": "Exploring the Fourth Quarter 2025 N-PORT Filing",
                        "source": "Yahoo! Finance: GOOGL News",
                        "semantic_score": 0.2642
                    },
                    {
                        "summary": "Wesbanco Bank Inc. Has $91.71 Million Stock Holdings in Alphabet Inc. $GOOGL MarketBeat",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2548
                    },
                    {
                        "summary": "Zoom is ​increasingly squeezed by rivals such as Microsoft's Teams and Alphabet's Google Meet, which come bundled with broader workplace suites that often make them cheaper for enterprise customers. Despite a push to diversify ‌its offerings, Zoom ⁠has been grappling with slowing growth as pandemic-era work-from-home arrangements decline and employees return to offices. While ⁠its enterprise business has shown resilience, the online segment, which serves individual consumers and small businesses, has remained a weak spot.",
                        "source": "Yahoo! Finance: GOOGL News",
                        "semantic_score": 0.1957
                    }
                ],
                "regulation": [
                    {
                        "summary": "Ex-Google Engineers Secure $500 Million for Nvidia Stock Rival MatX TipRanks",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3047
                    },
                    {
                        "summary": "Russia fines Google for hosting VPN apps",
                        "source": "Alphabet Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2658
                    }
                ],
                "general": [
                    {
                        "summary": "Alphabet (GOOGL) Stock Quotes, Company News And Chart Analysis Investor's Business Daily",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2947
                    },
                    {
                        "summary": "Is It Too Late To Consider Alphabet (GOOGL) After Its Strong 1 Year Share Price Run? simplywall.st",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2423
                    },
                    {
                        "summary": "Representatives of firms including Amazon.com Inc., Meta Platforms Inc., Microsoft Corp. and Google parent Alphabet Inc. are expected to attend a March 4 event with the president, a White House official said. Others on the invite list include Elon Musk’s xAI Corp., Oracle Corp. and OpenAI Inc.",
                        "source": "Yahoo! Finance: GOOGL News",
                        "semantic_score": 0.1872
                    }
                ]
            },
            "2026-02-05": {
                "earnings": [
                    {
                        "summary": "Google Earnings Beat. Cloud Capex Boom To Hit Free Cash Flow. Investor's Business Daily",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.5736
                    },
                    {
                        "summary": "GOOGL Stock: Alphabet Earnings Overshadowed by CapEx Barron's",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.4533
                    },
                    {
                        "summary": "Alphabet: Solid Results, Stock Down. Another Gift From The Market (NASDAQ:GOOGL) Seeking Alpha",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3111
                    }
                ],
                "general": [
                    {
                        "summary": "Alphabet stock sinks after Google parent announces $180 billion spending plan for 2026 in massive AI bet Yahoo Finance",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3245
                    }
                ]
            },
            "2026-02-04": {
                "earnings": [
                    {
                        "summary": "Google parent beats on revenue, projects significant AI spending increase CNBC",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.4582
                    },
                    {
                        "summary": "Google Earnings: What The Buy Side Expects From Cloud Computing Business Investor's Business Daily",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.4084
                    },
                    {
                        "summary": "Is Alphabet Stock a Buy as Google Cloud Revenue Soars? The Motley Fool",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.4071
                    }
                ],
                "analyst": [
                    {
                        "summary": "Top Mizuho Analyst Raises Alphabet (GOOGL) Stock Price Target Ahead of Q4 Earnings TipRanks",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.4639
                    }
                ]
            },
            "2026-02-02": {
                "earnings": [
                    {
                        "summary": "Will Alphabet’s Q4 Earnings Send GOOGL Stock Higher? Yahoo Finance",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.431
                    },
                    {
                        "summary": "Here's How Much Alphabet Stock Is Expected to Move After Earnings on Wednesday Investopedia",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3947
                    },
                    {
                        "summary": "Should You Buy, Sell, or Hold GOOGL Stock Before Q4 Earnings Release? Zacks Investment Research",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3635
                    }
                ]
            },
            "2026-02-23": {
                "analyst": [
                    {
                        "summary": "Wall Street updates Google stock price target for next 12 months Finbold",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.4082
                    },
                    {
                        "summary": "Google Stock: Wells Fargo Upgrades On Three Traits Of \"AI Winner\" Investor's Business Daily",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.378
                    },
                    {
                        "summary": "Wells Fargo Upgrades Alphabet Stock Due to Multiple AI-Related Opportunities TipRanks",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3292
                    },
                    {
                        "summary": "Wells Fargo upgrades Google on AI compute capacity advantage",
                        "source": "Alphabet Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2591
                    }
                ],
                "corporate": [
                    {
                        "summary": "Alphabet Stock (GOOGL) Opinions on AI Infrastructure Expansion Quiver Quantitative",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2253
                    }
                ],
                "management": [
                    {
                        "summary": "GOOGL Stock Rises 4%: Alphabet’s Cloud Segment Powers AI Leadership Eudaimonia and Co",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3363
                    }
                ],
                "earnings": [
                    {
                        "summary": "GOOGL Stock Quote Price and Forecast CNN",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.221
                    }
                ],
                "general": [
                    {
                        "summary": "‘Time to Get More Constructive,’ Says Wells Fargo on Alphabet Stock (GOOGL) TipRanks",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2751
                    }
                ]
            },
            "2026-02-24": {
                "corporate": [
                    {
                        "summary": "Alphabet (GOOG) stock slips as Google data center power deal puts AI spending back in focus TechStock²",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2804
                    },
                    {
                        "summary": "Klaviyo climbs on Google partnership to fuel 'autonomous customer experiences'",
                        "source": "Alphabet Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2161
                    }
                ],
                "general": [
                    {
                        "summary": "Assessing Alphabet (GOOGL) Valuation After Recent Share Price Pullback And Mixed Return Profile simplywall.st",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3198
                    },
                    {
                        "summary": "Is GOOGL Stock's Bull Run Over? Charles Moon Is Betting Against Alphabet This March, Expects 4% Decline Benzinga",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2606
                    }
                ]
            },
            "2026-02-26": {
                "corporate": [
                    {
                        "summary": "Alphabet, parent of Google (NasdaqGS:GOOGL), has entered into major energy deals with Xcel Energy in Minnesota and AES Corporation in Texas to supply new data centers with large-scale clean power. The partnerships include plans for what is described as the world's largest iron air battery system and multi decade energy infrastructure commitments tied to Google's facilities. These projects are designed to support rising power needs from AI and cloud computing while responding to regulatory...",
                        "source": "Yahoo! Finance: GOOGL News",
                        "semantic_score": 0.2027
                    },
                    {
                        "summary": "Will Long-Term Clean Energy Deals for AI Data Centers Change Alphabet's (GOOGL) Infrastructure Narrative? simplywall.st",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.1549
                    }
                ],
                "earnings": [
                    {
                        "summary": "Key PointsAlphabet's revenue growth accelerated to 18% year over year in the fourth quarter of 2025.",
                        "source": "GOOGL Feed",
                        "semantic_score": 0.5296
                    }
                ]
            },
            "2026-02-18": {
                "management": [
                    {
                        "summary": "Alphabet Is Doing Well Under CEO Sundar Pichai",
                        "source": "Alphabet Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3013
                    }
                ],
                "general": [
                    {
                        "summary": "Alphabet: Gemini And Google Cloud Put Company In The AI Revolution's Pantheon",
                        "source": "Alphabet Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1541
                    }
                ]
            },
            "2026-02-22": {
                "earnings": [
                    {
                        "summary": "Alphabet (GOOGL) Stock Overtakes Apple and Microsoft as America's Most Profitable Company CoinCentral",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3874
                    }
                ]
            },
            "2026-02-06": {
                "earnings": [
                    {
                        "summary": "Bank of America resets Google stock forecast post-earnings thestreet.com",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2977
                    }
                ]
            },
            "2026-01-30": {
                "earnings": [
                    {
                        "summary": "Google Stock In Buy Zone Ahead Of Earnings Feb. 4; Is It Actionable Now? Investor's Business Daily",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3379
                    }
                ]
            },
            "2026-02-20": {
                "general": [
                    {
                        "summary": "Alphabet (GOOGL) Stock Trades Up, Here Is Why Yahoo Finance",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2648
                    }
                ],
                "earnings": [
                    {
                        "summary": "Google stock (GOOG) jumps after Supreme Court tariff ruling as traders brace for Nvidia earnings TechStock²",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3506
                    }
                ]
            },
            "2026-02-17": {
                "general": [
                    {
                        "summary": "Monness Maintains Neutral Stance on Alphabet Inc. (GOOGL) Stock Yahoo Finance",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2165
                    }
                ]
            },
            "2026-02-21": {
                "general": [
                    {
                        "summary": "Alphabet GOOG stock jumps 3.7% — what to watch next week for Google shares TechStock²",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.3325
                    }
                ]
            },
            "2026-02-16": {
                "general": [
                    {
                        "summary": "Calm Waters for Alphabet (GOOG, GOOGL) Stock Present a Tempting Options Trade Barchart.com",
                        "source": "\"GOOGL stock\" - Google News",
                        "semantic_score": 0.2349
                    }
                ]
            }
        }
    },
    "META": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Louisiana utility regulators denied an environmental law group's request to investigate a $27 billion Meta Platforms ‌data center deal, the law group Earthjustice said ‌on Wednesday. Earthjustice filed a motion last month with the Louisiana Public Service ​Commission asking it to probe project financing, which the group said could ultimately shift project costs unfairly onto utility customers. The motion centered on Meta's proposed data center project in ‌Richland Parish, Louisiana, for ⁠which three new gas-fired power plants would be built.",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.4335
                    },
                    {
                        "summary": "Meta Platforms: The Growth Machine That Keeps On Giving",
                        "source": "Meta Platforms, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3712
                    },
                    {
                        "summary": "Nvidia stock climbs ahead of earnings as AMD-Meta deal keeps AI chip stocks in play TechStock²",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.364
                    },
                    {
                        "summary": "Meta stock rises after $60 billion AMD AI chip pact, with Nvidia earnings next TechStock²",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3546
                    },
                    {
                        "summary": "Syon Capital LLC Boosts Stock Position in Meta Platforms, Inc. $META MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3401
                    },
                    {
                        "summary": "Meta Platforms (NASDAQ:META) Stock Price Up 2.3% - What's Next? MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3289
                    },
                    {
                        "summary": "Axxcess Wealth Management LLC Buys 5,866 Shares of Meta Platforms, Inc. $META MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3025
                    },
                    {
                        "summary": "Maridea Wealth Management LLC Buys 4,907 Shares of Meta Platforms, Inc. $META MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2803
                    },
                    {
                        "summary": "Cracking the Chip Monopoly: Meta Invests in AMD Chips MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2787
                    },
                    {
                        "summary": "Bornite Capital Management LP Reduces Stock Position in Meta Platforms, Inc. $META MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2767
                    },
                    {
                        "summary": "CoreWeave stock ticks up as Bloomberg flags $8.5B Meta-backed loan talks ahead of earnings TechStock²",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2399
                    },
                    {
                        "summary": "Piper Sandler keeps AMD stock Overweight on Meta AI chip deal Investing.com",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2377
                    },
                    {
                        "summary": "First National Bank of Omaha Invests $25.28 Million in Meta Platforms, Inc. $META MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2076
                    }
                ],
                "analyst": [
                    {
                        "summary": "AMD Stock in Focus after Meta’s $100B Deal – Analysts Call it a ‘Major Milestone’ TipRanks",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3527
                    },
                    {
                        "summary": "Bank of America reiterated its ‘Buy’ ratings on both Meta Platforms Inc (NASDAQ:META, XETRA:FB2A, SIX:FB) and Advanced Micro Devices Inc (NASDAQ:AMD, XETRA:AMD) following their newly announced multi-year AI infrastructure agreement, arguing the deal strengthens long-term positioning for both...",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.3368
                    }
                ],
                "regulation": [
                    {
                        "summary": "Meta eyes stablecoin integration by second half 2026 - report",
                        "source": "Meta Platforms, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1682
                    }
                ],
                "general": [
                    {
                        "summary": "Meta Platforms, Inc. (NASDAQ: META) today announced that Susan Li, Chief Financial Officer, will participate in the Morgan Stanley Technology, Media & Telecom Conference on March 4, 2026 at 11:30 a.m. Pacific Time.",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.1913
                    },
                    {
                        "summary": "Representatives of firms including Amazon.com Inc., Meta Platforms Inc., Microsoft Corp. and Google parent Alphabet Inc. are expected to attend a March 4 event with the president, a White House official said. Others on the invite list include Elon Musk’s xAI Corp., Oracle Corp. and OpenAI Inc.",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.1872
                    },
                    {
                        "summary": "Microsoft and fellow hyperscalers ramp AI spending as agentic AI shifts from chat to action, spotlighting new disruptors like Monday.com.",
                        "source": "META Feed",
                        "semantic_score": 0.1693
                    }
                ],
                "corporate": [
                    {
                        "summary": "Is AMD Stock Going to $300 After the Meta Platforms Deal? Yahoo Finance",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2933
                    },
                    {
                        "summary": "Is AMD Stock Going to $300 After the Meta Platforms Deal? The Motley Fool",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.29
                    },
                    {
                        "summary": "Is the AMD Deal Good or Bad for Meta Stock? BofA Has Its Say TipRanks",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2859
                    }
                ]
            },
            "2026-01-28": {
                "earnings": [
                    {
                        "summary": "Meta shares jump 10% on stronger-than-expected revenue forecast CNBC",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.471
                    }
                ],
                "analyst": [
                    {
                        "summary": "Meta: Shock And Awe (Rating Downgrade) Seeking Alpha",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2685
                    }
                ]
            },
            "2026-02-26": {
                "analyst": [
                    {
                        "summary": "Evaluation of META stock downgraded after the last trading session StockInvest.us",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2759
                    }
                ],
                "corporate": [
                    {
                        "summary": "Investor Ross Gerber of the investment firm Gerber Kawasaki has warned Tesla Inc. (NASDAQ:TSLA) investors of the potential ramifications of stock-based employee compensation, drawing parallels with Meta Platforms Inc.'s (NASDAQ:META) share buybacks. A Real Cost The investor took to the social media platform X on Monday, warning Tesla shareholders that stock compensation was a real cost for companies. \"Tesla shareholders should pay attention to this regarding meta,\" he said, then shared a quote f",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.2726
                    },
                    {
                        "summary": "Advanced Micro Devices (NasdaqGS:AMD) and Meta Platforms have agreed a multi-year, multi-billion dollar AI chip and infrastructure partnership. The deal covers up to six gigawatts of customized AI compute for Meta's data centers. Meta may acquire up to a 10% equity stake in AMD through performance-based warrants tied to the partnership. For AMD, a major supplier of CPUs and GPUs, this agreement connects the company directly to one of the largest AI infrastructure buildouts currently...",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.2429
                    },
                    {
                        "summary": "Meta’s Massive AMD AI Deal Recasts Spending, Suppliers And Future Returns simplywall.st",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2168
                    }
                ],
                "earnings": [
                    {
                        "summary": "Oklo (NYSE:OKLO) has secured several binding contracts for advanced nuclear power, including a clean energy supply agreement with Meta that features a prepayment component. The company is advancing its next generation reactor technologies alongside ongoing regulatory progress. Oklo acquired Atomic Alchemy, adding radioisotope production as a new business line alongside its reactor projects. These developments expand Oklo's potential revenue sources and customer base across sectors with...",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.2766
                    },
                    {
                        "summary": "Advanced Micro Devices (AMD) stock has lost about 18% in the past month, at the time of writing, Wednesday afternoon, Feb. 25, according to Yahoo Finance. Meanwhile, the SPDR S&P 500 index (SPY) is up about 0.4% in the same period. The stock crashed following its Q4 earnings report on February ...",
                        "source": "Yahoo! Finance: META News",
                        "semantic_score": 0.2655
                    },
                    {
                        "summary": "Meta Platforms (NASDAQ:META) COO Sells $604,381.68 in Stock MarketBeat",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2342
                    }
                ]
            },
            "2026-02-19": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Coatue Management's top holdings: TSM, MSFT, META, AMZN",
                        "source": "Meta Platforms, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3017
                    }
                ]
            },
            "2026-02-18": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Bill Ackman’s Pershing Square Q4 holdings: BN, UBER, AMZN, GOOG, META",
                        "source": "Meta Platforms, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2885
                    }
                ],
                "corporate": [
                    {
                        "summary": "Nvidia's multi-year deal with Meta is a 'positive catalyst' for the chip giant: Needham",
                        "source": "Meta Platforms, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1936
                    }
                ]
            },
            "2026-02-24": {
                "corporate": [
                    {
                        "summary": "AMD Stock Rises On Meta AI Infrastructure Deal Investor's Business Daily",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3459
                    },
                    {
                        "summary": "AMD Stock Surges After AI Chip Maker Agrees to Meta Deal. It's a Big Win. Barron's",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3429
                    },
                    {
                        "summary": "Networking, AI stocks jump on back of AMD-Meta megadeal",
                        "source": "Meta Platforms, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2505
                    },
                    {
                        "summary": "Stock-Split Watch: Is Meta Platforms Next? The Globe and Mail",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2181
                    }
                ],
                "management": [
                    {
                        "summary": "AMD CEO Says Meta Stock Deal Ties Company to a Market Leader WSJ",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3772
                    }
                ],
                "general": [
                    {
                        "summary": "Meta (META) Stock; Dips Amid Massive AI Investment and Funding Risks CoinCentral",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2635
                    }
                ],
                "earnings": [
                    {
                        "summary": "Nvidia Stock Reacts After AMD, Meta Deal. Why Wall Street Is Bullish Ahead of Earnings. Barron's",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.4108
                    },
                    {
                        "summary": "Meta Platforms (META) Stock Dips on Heavy AI Capex Outlook Despite Strong Earnings International Business Times Australia",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3907
                    },
                    {
                        "summary": "Meta stock slips as AMD AI chip pact puts spending back in focus ahead of Nvidia earnings TechStock²",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.2801
                    }
                ]
            },
            "2026-02-11": {
                "general": [
                    {
                        "summary": "Meta Is Quietly Building a New Moat: Is META Stock A Buy Now? Yahoo Finance",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3376
                    }
                ]
            },
            "2026-01-29": {
                "earnings": [
                    {
                        "summary": "Meta Stock Rises on Strong Earnings. Expenses Are Mounting. Barron's",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.519
                    },
                    {
                        "summary": "Meta Stock Jumps. Zuckerberg Touts 'Major AI Acceleration' As Sales Forecast Wows. Investor's Business Daily",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.4324
                    },
                    {
                        "summary": "Meta stock climbs on Q4 earnings beat, plans to spend as much as $135 billion on AI build-out in 2026 Yahoo Finance",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.4073
                    },
                    {
                        "summary": "Bank of America resets Meta stock price target after earnings thestreet.com",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3458
                    }
                ]
            },
            "2026-02-04": {
                "earnings": [
                    {
                        "summary": "After Earnings, Is Meta Stock a Buy, a Sell, or Fairly Valued? Morningstar Canada",
                        "source": "\"META stock\" - Google News",
                        "semantic_score": 0.3344
                    }
                ]
            },
            "2026-02-17": {
                "corporate": [
                    {
                        "summary": "Nvidia announces multi-year partnership with Meta to expand AI infrastructure",
                        "source": "Meta Platforms, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2624
                    }
                ]
            }
        }
    },
    "BAC": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "Bank of America Corporation $BAC Shares Acquired by Mufg Securities Americas Inc. MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3795
                    },
                    {
                        "summary": "Bank of America Corporation $BAC Shares Acquired by Clearstead Advisors LLC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3653
                    },
                    {
                        "summary": "Cowa LLC Sells 9,880 Shares of Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3261
                    },
                    {
                        "summary": "Dakota Wealth Management Cuts Stake in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2788
                    }
                ],
                "analyst": [
                    {
                        "summary": "Bank of America N Or Q Preferred Shares: Q Is The Better Choice (Rating Upgrade)",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3885
                    },
                    {
                        "summary": "While Bank of America has underperformed the SPX over the past year, Wall Street analysts maintain a strongly optimistic outlook on the stock’s prospects.",
                        "source": "Yahoo! Finance: BAC News",
                        "semantic_score": 0.3636
                    },
                    {
                        "summary": "The latest analyst update for American Water Works Company trims the fair value estimate slightly, from US$138.70 to US$138.40, a shift of about 0.2%. That small move toward roughly US$139 is being framed very differently by bullish and bearish analysts, with one camp seeing risk now better reflected in the price and the other still focused on merger and execution questions. As you read on, you will see how these competing views shape the evolving narrative around the stock and what that...",
                        "source": "Yahoo! Finance: BAC News",
                        "semantic_score": 0.3335
                    }
                ],
                "management": [
                    {
                        "summary": "The Trump administration is considering an executive order that would require banks to gather citize",
                        "source": "Yahoo! Finance: BAC News",
                        "semantic_score": 0.1839
                    }
                ],
                "general": [
                    {
                        "summary": "Bank of America stock price today: BAC falls as tariff chaos and AI worries keep banks on edge TechStock²",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3335
                    },
                    {
                        "summary": "In trading on Tuesday, shares of Bank of America Corp (Symbol: BAC) crossed below their 200 day moving average of $50.20, changing hands as low as $49.47 per share. Bank of America Corp shares are currently trading down about 2.3% on the day. The chart below shows the one year",
                        "source": "BAC Feed",
                        "semantic_score": 0.3148
                    },
                    {
                        "summary": "Bank of America (NYSE:BAC), a global financial-services provider, closed Tuesday at $50.41, down 1.29%. The stock slipped as investors continued to react to recent tariff-related pressure on bank shares and weighed coverage noting its underperformance versus the S&P 500 over",
                        "source": "BAC Feed",
                        "semantic_score": 0.226
                    }
                ]
            },
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Empirical Asset Management LLC Boosts Stock Position in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3659
                    },
                    {
                        "summary": "Bank of America Corporation $BAC Shares Bought by Bradley Foster & Sargent Inc. CT MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3499
                    },
                    {
                        "summary": "Bank of America Corporation $BAC Shares Sold by Rollins Financial Advisors LLC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.319
                    },
                    {
                        "summary": "Waratah Capital Advisors Ltd. Takes Position in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3083
                    }
                ],
                "analyst": [
                    {
                        "summary": "Equifax’s fair value estimate has been trimmed to US$238.55 from US$243.15, a small reset that still sits just below at least one bank’s reinstated US$250 price target. That spread reflects the split you are seeing in recent research, with some analysts focusing on long term earnings potential and others placing more emphasis on near term risks and the valuation reset. Read on to see what is driving those views and how you can track the story as it evolves. Stay updated as the Fair Value for...",
                        "source": "Yahoo! Finance: BAC News",
                        "semantic_score": 0.3495
                    }
                ],
                "general": [
                    {
                        "summary": "Bank of America (BAC) Stock Dips to $50.41 Amid Economic Uncertainty and Tariff Pressures International Business Times Australia",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3177
                    },
                    {
                        "summary": "Bank of America (BAC) concluded the recent trading session at $51.69, signifying a +2.54% move from its prior day's close.",
                        "source": "BAC Feed",
                        "semantic_score": 0.2909
                    },
                    {
                        "summary": "Bank of America stock is moving before the bell — here’s what BAC traders are watching TechStock²",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2402
                    }
                ]
            },
            "2026-02-06": {
                "analyst": [
                    {
                        "summary": "Bank of America (NYSE:BAC) Stock Price Up 2.9% Following Analyst Upgrade MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.4617
                    }
                ]
            },
            "2026-02-18": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Berkshire Hathaway's top holdings: AAPL, AXP, BAC, KO",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.335
                    }
                ],
                "general": [
                    {
                        "summary": "Bank of America Stock (BAC) Offers Mean-Reversion Options Trade TipRanks",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3484
                    },
                    {
                        "summary": "Bank of America (NYSE: BAC) vice chair nets shares from RSU vesting and tax deliveries Stock Titan",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2399
                    }
                ]
            },
            "2026-02-23": {
                "corporate": [
                    {
                        "summary": "Bank Of America (BAC) Valuation Check As It Commits US$25 Billion To Private Credit Expansion simplywall.st",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2656
                    }
                ],
                "management": [
                    {
                        "summary": "Bank of America (NYSE:BAC) is allocating US$25b to expand its presence in the private credit market and has appointed new leadership to oversee the effort. The bank is rolling out an expanded BofA Rewards program aimed at deepening client engagement across products and channels. For high net worth clients, Bank of America is launching art consulting services focused on collection advice and related wealth needs. For a large universal bank like Bank of America, a US$25b push into private...",
                        "source": "Yahoo! Finance: BAC News",
                        "semantic_score": 0.315
                    }
                ],
                "earnings": [
                    {
                        "summary": "Cardinal Health surges to 52-week highs after strong earnings, while industry strength and rising estimates fuel its bullish outlook.",
                        "source": "BAC Feed",
                        "semantic_score": 0.441
                    },
                    {
                        "summary": "Private Advisory Group LLC Sells 15,804 Shares of Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.319
                    },
                    {
                        "summary": "BAC Stock Quote Price and Forecast CNN",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2986
                    },
                    {
                        "summary": "Equitable Trust Co. Has $14.73 Million Stock Holdings in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2901
                    },
                    {
                        "summary": "Payden & Rygel Has $29.38 Million Holdings in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.287
                    }
                ],
                "general": [
                    {
                        "summary": "Bank of America (BAC) Strengthens Private Credit Platform with $25B Deployment Finviz",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2511
                    }
                ],
                "analyst": [
                    {
                        "summary": "Investing.com -- Bank of America believes rising memory prices are set to weigh on Dell Technologies’ near-term profitability, prompting the bank to trim its price target to $135 from $150 per share in a note on Monday, while reiterating a Buy rating.",
                        "source": "Yahoo! Finance: BAC News",
                        "semantic_score": 0.3754
                    }
                ]
            },
            "2026-02-19": {
                "corporate": [
                    {
                        "summary": "Bank of America commits $25B to private credit deals - report (BAC:NYSE) Seeking Alpha",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3205
                    },
                    {
                        "summary": "Bank of America commits $25B to private credit deals - report",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3039
                    }
                ]
            },
            "2026-02-03": {
                "corporate": [
                    {
                        "summary": "Bank of America declares $0.28 dividend",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1911
                    }
                ]
            },
            "2026-02-13": {
                "management": [
                    {
                        "summary": "Bank of America pays CEO Brian Moynihan $41M for 2025",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3208
                    }
                ]
            },
            "2026-02-04": {
                "general": [
                    {
                        "summary": "Is There Still Value In Bank Of America (BAC) After Recent Share Price Pullback? simplywall.st",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3554
                    }
                ]
            },
            "2026-02-10": {
                "general": [
                    {
                        "summary": "Bank of America Corporation (BAC) Presents at Bank of America Financial Services Conference 2026 Transcript",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2084
                    }
                ]
            },
            "2026-02-22": {
                "earnings": [
                    {
                        "summary": "Sigma Planning Corp Raises Position in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3755
                    }
                ],
                "general": [
                    {
                        "summary": "Bank of America stock in focus: what BAC investors watch after the tariff ruling rally TechStock²",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2992
                    }
                ]
            },
            "2026-02-21": {
                "earnings": [
                    {
                        "summary": "Smead Capital Management Inc. Decreases Holdings in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3456
                    }
                ]
            },
            "2026-02-12": {
                "earnings": [
                    {
                        "summary": "Bank of America (NYSE:BAC) Stock Price Down 2.5% - What's Next? MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3007
                    }
                ]
            },
            "2026-02-11": {
                "earnings": [
                    {
                        "summary": "Bank of America (NYSE:BAC) Stock Price Down 2.7% - What's Next? MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3023
                    },
                    {
                        "summary": "ING Groep NV Decreases Stock Position in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2939
                    }
                ],
                "general": [
                    {
                        "summary": "Fund Update: New $2.4B $BAC stock position opened by Capital International Investors Quiver Quantitative",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3347
                    }
                ]
            },
            "2026-02-15": {
                "earnings": [
                    {
                        "summary": "Aberdeen Group plc Lowers Stock Holdings in Bank of America Corporation $BAC MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.2931
                    }
                ]
            },
            "2026-02-05": {
                "earnings": [
                    {
                        "summary": "Bank of America to revamp credit cards to fuel consumer profit - report",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2578
                    }
                ]
            },
            "2026-02-26": {
                "earnings": [
                    {
                        "summary": "Advanced Micro Devices (AMD) stock has lost about 18% in the past month, at the time of writing, Wednesday afternoon, Feb. 25, according to Yahoo Finance. Meanwhile, the SPDR S&P 500 index (SPY) is up about 0.4% in the same period. The stock crashed following its Q4 earnings report on February ...",
                        "source": "Yahoo! Finance: BAC News",
                        "semantic_score": 0.2655
                    }
                ]
            },
            "2026-01-28": {
                "earnings": [
                    {
                        "summary": "Bank of America's Rock-Bottom P/E and 25% Upside Potential MarketBeat",
                        "source": "\"BAC stock\" - Google News",
                        "semantic_score": 0.3935
                    }
                ]
            },
            "2026-02-17": {
                "general": [
                    {
                        "summary": "Fed proposes rules to bring mortgages back to the big banks",
                        "source": "Bank of America Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1529
                    }
                ]
            }
        }
    },
    "INTC": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "Kovitz Investment Group Partners LLC Acquires 41,814 Shares of Intel Corporation $INTC MarketBeat",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3989
                    },
                    {
                        "summary": "25,000 Shares in Intel Corporation $INTC Bought by Nkcfo LLC MarketBeat",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3194
                    }
                ],
                "corporate": [
                    {
                        "summary": "Intel partners with AI chip startup SambaNova after acquisition talks reportedly failed CNBC",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3471
                    },
                    {
                        "summary": "Intel Stock (NASDAQ:INTC) Blasts Up With SambaNova Deal TipRanks",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2887
                    },
                    {
                        "summary": "Why Is Intel Stock Moving Higher in Premarket? Multi-Year AI Deal With SambaNova Tokenist",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2693
                    },
                    {
                        "summary": "Intel (INTC) Stock Closes at $43.63 as SambaNova AI Partnership Provides Lift Amid Ongoing Challenges International Business Times Australia",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2549
                    },
                    {
                        "summary": "AI chip startup SambaNova raises $350 million in Vista-led round, signs Intel partnership Reuters",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2465
                    },
                    {
                        "summary": "Nvidia Stake Puts Intel At Center Of AI Partnership And Rivalry simplywall.st",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2365
                    }
                ],
                "management": [
                    {
                        "summary": "Intel strikes deal with AI chip start-up SambaNova its CEO Lip-Bu Tan invested in",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.314
                    },
                    {
                        "summary": "Intel Teams Up With AI Chip Startup That Its New CEO Lip-Bu Tan Is Invested In Stocktwits",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2452
                    },
                    {
                        "summary": "Intel stock (INTC) ticks up premarket after CFO conference slot, after five-day slide TechStock²",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2268
                    }
                ],
                "general": [
                    {
                        "summary": "Why Is Intel Stock Trading Higher Today? - Intel (NASDAQ:INTC) Benzinga",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.298
                    },
                    {
                        "summary": "Why Is Intel (INTC) Stock Soaring Today Yahoo Finance",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.271
                    },
                    {
                        "summary": "“Unearthing Rationality”: Intel Stock (NASDAQ:INTC) Dips as Nova Lake Gets Delayed TipRanks",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2422
                    },
                    {
                        "summary": "Maybe We Hate Intel (INTC) Too Much, Says Jim Cramer Yahoo Finance",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2117
                    }
                ]
            },
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Intel (NASDAQ:INTC) Stock Price Up 1.6% - Should You Buy? MarketBeat",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.349
                    },
                    {
                        "summary": "Waddell & Associates LLC Increases Stock Position in Intel Corporation $INTC MarketBeat",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3194
                    },
                    {
                        "summary": "Intel stock jumps nearly 6% on SambaNova AI tie-up as Nvidia earnings loom Bez Kabli",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3059
                    },
                    {
                        "summary": "EverSource Wealth Advisors LLC Buys 13,700 Shares of Intel Corporation $INTC MarketBeat",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2905
                    }
                ],
                "corporate": [
                    {
                        "summary": "Intel stock price dips after SambaNova AI partnership pop — what to watch next TechStock²",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2806
                    }
                ],
                "general": [
                    {
                        "summary": "Intel (INTC) Stock Surges 90% in a Year — Can the Rally Last? CoinCentral",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2824
                    },
                    {
                        "summary": "Community Colleges Prove Fertile Ground for AI’s Next Generation: Intel Stock (NASDAQ:INTC) Gains TipRanks",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2684
                    },
                    {
                        "summary": "As Intel Partners with SambaNova, Should You Buy, Sell, or Hold INTC Stock? Barchart.com",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2526
                    },
                    {
                        "summary": "Did Intel's SambaNova AI Alliance Just Rewire the (INTC) Investment Narrative? simplywall.st",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2421
                    },
                    {
                        "summary": "Morgan Stanley Lifts Intel (INTC) to $41, Flags Near-Term Foundry Constraints Yahoo Finance",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2234
                    }
                ]
            },
            "2026-02-22": {
                "earnings": [
                    {
                        "summary": "Intel Corporation $INTC Shares Bought by Empirical Financial Services LLC d.b.a. Empirical Wealth Management MarketBeat",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3231
                    },
                    {
                        "summary": "265,000 Shares in Intel Corporation $INTC Purchased by Premier Fund Managers Ltd MarketBeat",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2775
                    }
                ]
            },
            "2026-02-02": {
                "analyst": [
                    {
                        "summary": "How Intel (INTC) Story Is Shifting As Analysts Rethink Its Edge Over Rivals Yahoo Finance",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.265
                    }
                ],
                "management": [
                    {
                        "summary": "Intel CFO sends blunt $250,000 message after stock crash thestreet.com",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3067
                    }
                ]
            },
            "2026-01-28": {
                "analyst": [
                    {
                        "summary": "Intel Stock Just Got a New Street-High Price Target. Should You Buy INTC Here? Yahoo Finance",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3723
                    }
                ],
                "management": [
                    {
                        "summary": "Intel in focus as CFO buys stock, Nvidia may use it for some of its 2028 production",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2318
                    }
                ],
                "general": [
                    {
                        "summary": "Why Intel (INTC) Stock Is Up Today Yahoo Finance",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2317
                    }
                ]
            },
            "2026-02-04": {
                "analyst": [
                    {
                        "summary": "Intel Stock Could Be In For A Reckoning (Rating Downgrade)",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3449
                    }
                ]
            },
            "2026-01-29": {
                "analyst": [
                    {
                        "summary": "Intel: Buy The Crash (Upgrade)",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2275
                    }
                ]
            },
            "2026-02-03": {
                "analyst": [
                    {
                        "summary": "Intel Stock Could Be In For A Reckoning (Rating Downgrade) Seeking Alpha",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.3407
                    }
                ],
                "management": [
                    {
                        "summary": "Intel CEO says company will build GPUs: report",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2043
                    },
                    {
                        "summary": "Tech Voices: Intel CEO on GPUs, memory chips; Nvidia; OpenAI",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1655
                    }
                ],
                "regulation": [
                    {
                        "summary": "Intel Corporation (INTC) Presents at Second Annual AI Summit Transcript",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1143
                    }
                ]
            },
            "2026-02-19": {
                "corporate": [
                    {
                        "summary": "Intel Stock (NASDAQ:INTC) Slips on New Concerns Over Nvidia/Meta Partnership TipRanks",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2719
                    }
                ],
                "general": [
                    {
                        "summary": "The Arc Series Is Not Out of Action Yet: Intel Stock (NASDAQ:INTC) Slides Regardless TipRanks",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2466
                    }
                ]
            },
            "2026-02-26": {
                "earnings": [
                    {
                        "summary": "The artificial intelligence (AI) tech leader's Q4 results and guidance indicate that demand for AI infrastructure remains very robust.",
                        "source": "Yahoo! Finance: INTC News",
                        "semantic_score": 0.137
                    }
                ],
                "general": [
                    {
                        "summary": "Intel Stock (INTC) Volatility Creates Tactical Options Discount TipRanks",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2496
                    }
                ],
                "management": [
                    {
                        "summary": "Nvidia may have made its immense fortune on the back of specialized graphics processing units (GPUs) used to power artificial intelligence servers, but CEO Jensen Huang is increasingly professing his love for the more generalist CPU. The CPU, or central processing unit, was for ‌decades traditionally viewed as the main brain of a computer - a product most associated with Intel or sometimes Advanced Micro Devices. Huang is fond of saying ‌that where once 90% of computing used to happen on CPUs and 10% on chips like his, the ratio had flipped in recent years.",
                        "source": "Yahoo! Finance: INTC News",
                        "semantic_score": 0.0922
                    }
                ]
            },
            "2026-02-23": {
                "general": [
                    {
                        "summary": "Intel (INTC) Valuation Check After Recent Share Price Swings simplywall.st",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.272
                    }
                ]
            },
            "2026-02-20": {
                "general": [
                    {
                        "summary": "Intel in India for the “Long Haul,” Intel Stock (NASDAQ:INTC) Still Slips TipRanks",
                        "source": "\"INTC stock\" - Google News",
                        "semantic_score": 0.2436
                    }
                ]
            },
            "2026-02-21": {
                "earnings": [
                    {
                        "summary": "Key PointsTech stocks, including Nvidia, are undergoing turmoil as Wall Street reevaluates artificial intelligence.",
                        "source": "INTC Feed",
                        "semantic_score": 0.244
                    }
                ]
            },
            "2026-02-10": {
                "general": [
                    {
                        "summary": "Intel investing at least $100M into SambaNova should help AI push: Wedbush",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2136
                    }
                ]
            },
            "2026-02-07": {
                "general": [
                    {
                        "summary": "Insider trades: Merck, Intel, Micron among notable names",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.263
                    }
                ]
            },
            "2026-01-31": {
                "general": [
                    {
                        "summary": "Insider trades: JNJ, Intel, IBM among notable names",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2235
                    }
                ]
            },
            "2026-02-13": {
                "general": [
                    {
                        "summary": "Intel: AI Momentum Builds, But Margins Lag",
                        "source": "Intel Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2011
                    }
                ]
            }
        }
    },
    "CSCO": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-12": {
                "earnings": [
                    {
                        "summary": "Cisco Q2 Results: Narrowing Margins Overshadow Earnings Beat, Shares Fairly Valued",
                        "source": "Cisco Systems, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5277
                    },
                    {
                        "summary": "Cisco Systems, Inc. (CSCO) Q2 2026 Earnings Call Transcript",
                        "source": "Cisco Systems, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3044
                    },
                    {
                        "summary": "Cisco Systems Inc. (CSCO) Shares Fall on Guidance and Margin Concerns Despite Q2 Beat AlphaStreet News",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2288
                    }
                ],
                "corporate": [
                    {
                        "summary": "Cisco raises dividend by 2.4% to $0.42",
                        "source": "Cisco Systems, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3362
                    }
                ]
            },
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Cisco Systems (CSCO) Stock Steady Near $64.50 After Record Q2 FY2026 Revenue Beat, AI Orders Surge International Business Times Australia",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.4132
                    },
                    {
                        "summary": "Cisco Systems, Inc. $CSCO Shares Acquired by Empirical Asset Management LLC MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3559
                    },
                    {
                        "summary": "Cisco Systems (NASDAQ:CSCO) Trading Up 1.3% - What's Next? MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3377
                    },
                    {
                        "summary": "Maria Victoria Wong Sells 2,179 Shares of Cisco Systems (NASDAQ:CSCO) Stock MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2433
                    },
                    {
                        "summary": "TD Asset Management Inc Trims Stock Holdings in Cisco Systems, Inc. $CSCO MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2305
                    }
                ],
                "analyst": [
                    {
                        "summary": "Cisco Systems has outpaced the Dow Jones Industrial Average over the past year, and analysts remain only cautiously optimistic on its outlook.",
                        "source": "Yahoo! Finance: CSCO News",
                        "semantic_score": 0.2624
                    }
                ],
                "corporate": [
                    {
                        "summary": "by Telethia Willis NORTHAMPTON, MA / ACCESS Newswire / February 25, 2026 /Building an inclusive digital workforce The disconnect between skilled talent and open jobs has become one of the most pressing challenges worldwide. Cisco Networking Academy ...",
                        "source": "Yahoo! Finance: CSCO News",
                        "semantic_score": 0.1304
                    }
                ]
            },
            "2026-02-09": {
                "earnings": [
                    {
                        "summary": "Cisco Q2 Earnings Loom: Buy or Hold the CSCO Stock Ahead of Results? - February 9, 2026 Zacks Investment Research",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3638
                    }
                ]
            },
            "2026-02-23": {
                "analyst": [
                    {
                        "summary": "Cisco (CSCO) might move higher on growing optimism about its earnings prospects, which is reflected by its upgrade to a Zacks Rank #1 (Strong Buy).",
                        "source": "CSCO Feed",
                        "semantic_score": 0.3431
                    },
                    {
                        "summary": "Cisco Systems, Inc. (NASDAQ:CSCO) is among the 9 Best Video Surveillance and Private Security Stocks to Buy. Cisco Systems, Inc. (NASDAQ:CSCO) is among the best video surveillance stocks. TheFly reported on February 18 that Erste Group lowered its rating on CSCO from Buy to Hold and cited concerns over declining gross margins. The firm predicted that revenue […]",
                        "source": "Yahoo! Finance: CSCO News",
                        "semantic_score": 0.2374
                    }
                ],
                "corporate": [
                    {
                        "summary": "BRUSSELS, HELSINKI, Feb 23 (Reuters) - ‌Finnish-headquartered IQM Quantum Computers is aiming to list its shares on the ‌U.S. stock market via a merger with a special purpose acquisition company Real Asset Acquisition Corp, the companies ​said on Monday. Quantum computers, which are much faster than conventional computers, are seen as crucial for cybersecurity, attracting funding from such tech giants as Microsoft, Alphabet, IBM and Cisco as ‌well as interest from several ⁠governments. In October, quantum computing stocks on Wall Street jumped following a Wall Street Journal report that the U.S. administration was considering taking stakes ⁠in such companies in exchange for federal funding.",
                        "source": "Yahoo! Finance: CSCO News",
                        "semantic_score": 0.3252
                    },
                    {
                        "summary": "(RTTNews) - Cisco (CSCO) and SharonAI Holdings (SHAZ) and its subsidiaries announced the launch of Australia's first Cisco Secure AI Factory in partnership with NVIDIA. Powered by 1024 NVIDIA Blackwell Ultra GPUs, Cisco's UCS servers and Nexus Hyperfabric technology, it supports",
                        "source": "CSCO Feed",
                        "semantic_score": 0.1626
                    }
                ],
                "general": [
                    {
                        "summary": "Cisco (CSCO) Sees Mixed Options Sentiment Amid Stock Price Drop GuruFocus",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2425
                    }
                ],
                "earnings": [
                    {
                        "summary": "Cisco Systems, Inc. $CSCO Shares Purchased by Kovitz Investment Group Partners LLC MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3262
                    },
                    {
                        "summary": "Cisco Systems, Inc. $CSCO Shares Acquired by Vestmark Advisory Solutions Inc. MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2943
                    },
                    {
                        "summary": "Payden & Rygel Sells 25,500 Shares of Cisco Systems, Inc. $CSCO MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2666
                    }
                ]
            },
            "2026-02-19": {
                "analyst": [
                    {
                        "summary": "Based on the average brokerage recommendation (ABR), Cisco (CSCO) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?",
                        "source": "CSCO Feed",
                        "semantic_score": 0.3273
                    }
                ],
                "earnings": [
                    {
                        "summary": "Cisco Systems, Inc. $CSCO Shares Bought by Harold Davidson & Associates Inc. MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3296
                    }
                ],
                "general": [
                    {
                        "summary": "Assessing Cisco (CSCO) Valuation After Recent Share Price Pullback And Longer Term Gains Yahoo Finance",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3432
                    }
                ]
            },
            "2026-02-15": {
                "corporate": [
                    {
                        "summary": "Cisco stock resets dividend payout as AI moat widens | CSCO thestreet.com",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2759
                    }
                ]
            },
            "2026-02-20": {
                "regulation": [
                    {
                        "summary": "PANW vs. CSCO: Which Cybersecurity Stock Is a Buy Right Now? Zacks Investment Research",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.287
                    },
                    {
                        "summary": "Cisco Systems edges past Palo Alto Networks with rising estimates, strong security adoption and lower valuation as integration costs weigh on PANW.",
                        "source": "CSCO Feed",
                        "semantic_score": 0.2283
                    }
                ]
            },
            "2026-02-03": {
                "regulation": [
                    {
                        "summary": "Cisco Systems, Inc. (CSCO) Presents at Second Annual AI Summit Prepared Remarks Transcript",
                        "source": "Cisco Systems, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.098
                    }
                ]
            },
            "2026-02-24": {
                "regulation": [
                    {
                        "summary": "Cisco today announced the release of Splunk's annual report, The CISO Report: From Risk to Resilience in the AI Era, surveying 650 global Chief Information Security Officers (CISOs). The report highlights CISOs' rapidly expanding role, their strategic approach to AI adoption, and a steadfast commitment to human talent as they confront an increasingly complex landscape.",
                        "source": "Yahoo! Finance: CSCO News",
                        "semantic_score": 0.2156
                    },
                    {
                        "summary": "Cisco Systems (NasdaqGS:CSCO) has launched Australia's first Secure AI Factory in partnership with SharonAI and NVIDIA. The facility is designed to support sovereign AI infrastructure and keep AI processing and data within Australia. The launch aligns with Australia's National AI Plan and focuses on data governance, security, and regulatory compliance. This move puts Cisco directly in the middle of how enterprises in Australia and the wider Asia Pacific think about AI, data control, and...",
                        "source": "Yahoo! Finance: CSCO News",
                        "semantic_score": 0.1655
                    }
                ],
                "earnings": [
                    {
                        "summary": "CSCO's fiscal Q2 networking revenues jump 21% to $8.29B as AI and campus demand fueled six straight quarters of double-digit order growth.",
                        "source": "CSCO Feed",
                        "semantic_score": 0.3622
                    },
                    {
                        "summary": "Cisco Systems, Inc. $CSCO Shares Sold by First Financial Bankshares Inc MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3165
                    },
                    {
                        "summary": "Cisco Systems (NASDAQ:CSCO) Shares Down 1.8% - What's Next? MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3019
                    },
                    {
                        "summary": "Cisco stock forecast for 2030: Can infrastructure push CSCO to $150 despite 12% margin collapse? Traders Union",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2864
                    }
                ]
            },
            "2026-02-13": {
                "general": [
                    {
                        "summary": "Where Will Cisco (CSCO) Stock Be in 5 Years? 24/7 Wall St.",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2551
                    },
                    {
                        "summary": "Cisco Systems Reports Lower Free Cash Flow - But, Is CSCO Stock a Buy Here? Yahoo Finance",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2433
                    }
                ]
            },
            "2026-02-17": {
                "general": [
                    {
                        "summary": "UBS Lifts PT on Cisco Systems, Inc. (CSCO) Stock Yahoo Finance",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2871
                    }
                ],
                "earnings": [
                    {
                        "summary": "What's next for Cisco after its post-earnings stock slide? (CSCO:NASDAQ) Seeking Alpha",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3756
                    },
                    {
                        "summary": "Rep. Gilbert Ray Cisneros, Jr. Buys Cisco Systems, Inc. (NASDAQ:CSCO) Stock MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3153
                    }
                ]
            },
            "2026-02-02": {
                "general": [
                    {
                        "summary": "Cisco Systems, Inc. (CSCO) is Attracting Investor Attention: Here is What You Should Know Yahoo Finance",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2895
                    }
                ],
                "earnings": [
                    {
                        "summary": "Cisco stock jumps 3% — here’s what CSCO traders are watching into earnings TechStock²",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3813
                    }
                ]
            },
            "2026-02-11": {
                "earnings": [
                    {
                        "summary": "Earnings Snapshot: Cisco sees strongest revenue year in FY26 after Q2 double-beat",
                        "source": "Cisco Systems, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5633
                    },
                    {
                        "summary": "Cisco Non-GAAP EPS of $1.04 beats by $0.02, revenue of $15.35B beats by $230M",
                        "source": "Cisco Systems, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5607
                    },
                    {
                        "summary": "CISCO REPORTS SECOND QUARTER EARNINGS PR Newswire",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.4281
                    },
                    {
                        "summary": "Cisco's stock drops 7% on mediocre forecast even as earnings and revenue top estimates CNBC",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.4255
                    },
                    {
                        "summary": "CSCO Earnings: Cisco Stock Slips despite Solid Q2 Results TipRanks",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3799
                    }
                ]
            },
            "2026-02-07": {
                "earnings": [
                    {
                        "summary": "Cisco stock jumps 3% into earnings week as tech shakeout keeps CSCO in focus TechStock²",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3929
                    }
                ]
            },
            "2026-02-08": {
                "earnings": [
                    {
                        "summary": "Earnings week ahead: F, KO, CSCO, SHOP, MCD, BP, AMAT, COIN, MRNA, ROKU, and more",
                        "source": "Cisco Systems, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4424
                    },
                    {
                        "summary": "Cisco Is About to Report Q2 Earnings. Options Traders Are Expecting a 5.97% Move in CSCO Stock TipRanks",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3462
                    }
                ]
            },
            "2026-02-18": {
                "earnings": [
                    {
                        "summary": "Cisco Systems (NASDAQ:CSCO) Shares Up 1.7% - Here's What Happened MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.3237
                    }
                ]
            },
            "2026-02-21": {
                "earnings": [
                    {
                        "summary": "Jupiter Asset Management Ltd. Has $24.94 Million Position in Cisco Systems, Inc. $CSCO MarketBeat",
                        "source": "\"CSCO stock\" - Google News",
                        "semantic_score": 0.2456
                    }
                ]
            }
        }
    },
    "KO": {
        "news_count": 50,
        "30_day_news": {
            "2026-02-20": {
                "earnings": [
                    {
                        "summary": "The Board of Directors of Coca-Cola today announced the election of a new company officer and the approval of the company's 64th consecutive annual dividend increase. The company is raising the quarterly dividend approximately 4% from 51 cents to 53 cents per common share. The",
                        "source": "KO Feed",
                        "semantic_score": 0.2889
                    }
                ]
            },
            "2026-02-09": {
                "earnings": [
                    {
                        "summary": "Coca-Cola set to report Q4 earnings as 2026 guidance takes center stage",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3434
                    },
                    {
                        "summary": "CocaCola Company (The) $KO Stock Holdings Lessened by Candriam S.C.A. MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3164
                    }
                ]
            },
            "2026-02-10": {
                "earnings": [
                    {
                        "summary": "Coca-Cola Non-GAAP EPS of $0.58 beats by $0.02, revenue of $11.8B misses by $250M",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5674
                    },
                    {
                        "summary": "Earnings Snapshot: Coca-Cola sees 4%–5% organic revenue growth in 2026, missing estimates",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5337
                    },
                    {
                        "summary": "Coca-Cola Earnings Today: What Results Could Move KO Stock? EBC Financial Group",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.4579
                    },
                    {
                        "summary": "Coca-Cola Earnings: KO Stock Drops after Q4 Revenue Miss on Weak US Demand TipRanks",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.4466
                    },
                    {
                        "summary": "The Coca-Cola Company 2025 Q4 - Results - Earnings Call Presentation",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4281
                    },
                    {
                        "summary": "Coca-Cola Earnings Today – Should You Buy KO Stock Ahead of Q4? TipRanks",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3945
                    },
                    {
                        "summary": "Coca-Cola's post-earnings decline is due to psychology, not fundamentals - SA analyst",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3938
                    },
                    {
                        "summary": "The Coca-Cola Company (KO) Q4 2025 Earnings Call Transcript",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.356
                    },
                    {
                        "summary": "CocaCola Company (The) $KO Stock Position Increased by Katamaran Capital LLP MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3388
                    },
                    {
                        "summary": "Coca-Cola falls after organic sales guidance disappoints; PepsiCo is also lower",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2659
                    }
                ],
                "analyst": [
                    {
                        "summary": "Coca-Cola is defended by analysts taking the long view",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2887
                    }
                ],
                "general": [
                    {
                        "summary": "Coca-Cola (KO) Stock Slips Despite Increased Sales from Less Sugary Drinks TipRanks",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3751
                    }
                ]
            },
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "First Financial Bankshares Inc Grows Stock Holdings in CocaCola Company (The) $KO MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3583
                    },
                    {
                        "summary": "CocaCola Company (The) $KO Shares Bought by Mufg Securities Americas Inc. MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.2999
                    }
                ],
                "analyst": [
                    {
                        "summary": "As Coca-Cola has outpaced its industry peers recently, analysts remain highly optimistic about the stock’s prospects.",
                        "source": "Yahoo! Finance: KO News",
                        "semantic_score": 0.3086
                    }
                ],
                "corporate": [
                    {
                        "summary": "CMO Tom Gargiulo explains how the sport drink’s refreshed “Choose Better” campaign will be activated around the March Madness tournament.",
                        "source": "Yahoo! Finance: KO News",
                        "semantic_score": 0.1867
                    }
                ],
                "management": [
                    {
                        "summary": "Coca-Cola (NYSE:KO) announced its 64th consecutive annual dividend increase, extending a multi decade record of shareholder payouts. The company also named Todd Beiger as vice president and head of investor relations and confirmed a CEO transition from James Quincey to Henrique Braun. These moves come as Coca-Cola continues to adjust its product lineup and packaging, including a focus on smaller and more affordable formats. Coca-Cola enters this news cycle with its shares at $80.56 and a...",
                        "source": "Yahoo! Finance: KO News",
                        "semantic_score": 0.3429
                    },
                    {
                        "summary": "Should Coca-Cola’s (KO) Steady Dividend Hikes and New Leadership Shape Investor Strategy Now? simplywall.st",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3393
                    }
                ]
            },
            "2026-02-17": {
                "analyst": [
                    {
                        "summary": "The Coca-Cola Company (KO) Presents at Consumer Analyst Group of New York Conference 2026 Prepared Remarks Transcript",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1991
                    }
                ]
            },
            "2026-02-05": {
                "analyst": [
                    {
                        "summary": "CocaCola (NYSE:KO) Stock Price Up 1.4% Following Analyst Upgrade MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.4023
                    }
                ],
                "earnings": [
                    {
                        "summary": "Ahead of Q4 Earnings, Let’s Look at Who Owns Coca-Cola Stock (KO) TipRanks",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3925
                    }
                ]
            },
            "2026-02-18": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Berkshire Hathaway's top holdings: AAPL, AXP, BAC, KO",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.335
                    }
                ],
                "earnings": [
                    {
                        "summary": "CocaCola Company (The) $KO Shares Bought by Advisors Capital Management LLC MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.305
                    }
                ]
            },
            "2026-02-03": {
                "corporate": [
                    {
                        "summary": "In Days, Coca-Cola Announces Its Next Dividend Increase: What Can Investors Expect? The Motley Fool",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3741
                    }
                ],
                "earnings": [
                    {
                        "summary": "Stock Traders Purchase Large Volume of CocaCola Call Options (NYSE:KO) MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.2374
                    }
                ]
            },
            "2026-02-19": {
                "corporate": [
                    {
                        "summary": "Coca-Cola has paid $101.9B in dividends since 2010—and is raising them again Stock Titan",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.317
                    }
                ],
                "earnings": [
                    {
                        "summary": "Coca-Cola raises quarterly dividend by 3.9% to $0.53/share",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3632
                    }
                ]
            },
            "2026-02-23": {
                "management": [
                    {
                        "summary": "Why Coca-Cola (KO) stock is rising as Wall Street slides — dividend and CEO handover in view Bez Kabli",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.4147
                    },
                    {
                        "summary": "What Coca-Cola (KO)'s 64th Straight Dividend Hike and IR Leadership Shift Means For Shareholders Yahoo Finance",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3708
                    },
                    {
                        "summary": "Coca-Cola (KO) Valuation Check After 4% Dividend Raise And New Investor Relations Leadership simplywall.st",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3462
                    }
                ],
                "general": [
                    {
                        "summary": "BofA Lifts Coca-Cola (KO) Target as Outlook and Execution Remain Strong Finviz",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.262
                    }
                ],
                "earnings": [
                    {
                        "summary": "Payden & Rygel Sells 142,000 Shares of CocaCola Company (The) $KO MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.2963
                    }
                ]
            },
            "2026-02-25": {
                "general": [
                    {
                        "summary": "Is Coca-Cola (KO) Priced Fairly After Strong Multi Year Share Price Performance simplywall.st",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3635
                    }
                ],
                "earnings": [
                    {
                        "summary": "MAI Capital Management Has $34.27 Million Stock Holdings in CocaCola Company (The) $KO MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.2739
                    },
                    {
                        "summary": "Coca-Cola (NYSE:KO) is temporarily halting U.S. availability of Topo Chico mineral water while it upgrades production facilities. BodyArmor, a Coca-Cola brand, has been named the official sports drink of NCAA March Madness and plans to launch a new product that could affect the sports hydration category. Henrique Braun is preparing to step into the CEO role at Coca-Cola, alongside the appointment of a new vice president of investor relations. Coca-Cola (NYSE:KO) earns most of its revenue...",
                        "source": "Yahoo! Finance: KO News",
                        "semantic_score": 0.2649
                    }
                ]
            },
            "2026-02-22": {
                "general": [
                    {
                        "summary": "Why The Coca-Cola Company (KO) Is One of the Best Sugar Stocks to Buy According to Hedge Funds Yahoo Finance",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3255
                    }
                ]
            },
            "2026-02-02": {
                "general": [
                    {
                        "summary": "Coca-Cola Stock (KO) Hits All-Time High — Can the Rally Keep Going? TipRanks",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3434
                    }
                ],
                "earnings": [
                    {
                        "summary": "Assessing Coca-Cola (KO) Valuation As Shares Strengthen Ahead Of Earnings And CEO Transition Yahoo Finance",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.4745
                    }
                ]
            },
            "2026-02-07": {
                "earnings": [
                    {
                        "summary": "Coca-Cola stock price ends near $79 — frozen products exit sets up KO earnings week TechStock²",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.2528
                    }
                ]
            },
            "2026-02-16": {
                "earnings": [
                    {
                        "summary": "Vanguard Group Inc. Raises Stock Holdings in CocaCola Company (The) $KO MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3591
                    }
                ]
            },
            "2026-02-11": {
                "earnings": [
                    {
                        "summary": "CocaCola (NYSE:KO) Stock Price Up 2.5% After Strong Earnings MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.4508
                    },
                    {
                        "summary": "KO Stock Today: February 11 — Q4 Profit Slumps, Outlook Weighs on Shares Meyka",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3625
                    },
                    {
                        "summary": "JPMorgan Chase & Co. Issues Positive Forecast for CocaCola (NYSE:KO) Stock Price MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.3512
                    },
                    {
                        "summary": "CocaCola Company (The) $KO Shares Sold by Advisors Asset Management Inc. MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.2838
                    }
                ]
            },
            "2026-02-01": {
                "earnings": [
                    {
                        "summary": "Coca-Cola stock price hits a fresh 52-week high — what KO investors watch before Feb. 10 earnings TechStock²",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.399
                    }
                ]
            },
            "2026-02-08": {
                "earnings": [
                    {
                        "summary": "Earnings week ahead: F, KO, CSCO, SHOP, MCD, BP, AMAT, COIN, MRNA, ROKU, and more",
                        "source": "The Coca-Cola Company - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4424
                    }
                ]
            },
            "2026-02-04": {
                "earnings": [
                    {
                        "summary": "CocaCola (NYSE:KO) Stock Price Expected to Rise, Jefferies Financial Group Analyst Says MarketBeat",
                        "source": "\"KO stock\" - Google News",
                        "semantic_score": 0.355
                    }
                ]
            }
        }
    },
    "XOM": {
        "news_count": 50,
        "30_day_news": {
            "2026-01-30": {
                "earnings": [
                    {
                        "summary": "Exxon Mobil Non-GAAP EPS of $1.71 beats by $0.02, revenue of $82.31B beats by $640M",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.5784
                    },
                    {
                        "summary": "Exxon's Q4 earnings decline Y/Y as production slips; full-year output reaches 40-year high",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4773
                    },
                    {
                        "summary": "Exxon Mobil Corporation 2025 Q4 - Results - Earnings Call Presentation",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.4603
                    },
                    {
                        "summary": "Exxon Mobil Corporation (XOM) Q4 2025 Earnings Call Transcript",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3631
                    }
                ],
                "corporate": [
                    {
                        "summary": "Exxon Mobil declares $1.03 dividend",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2642
                    }
                ]
            },
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "Exxon Mobil (NYSE:XOM) Stock Price Up 2.3% - What's Next? MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3813
                    },
                    {
                        "summary": "Mufg Securities Americas Inc. Grows Holdings in Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3498
                    },
                    {
                        "summary": "Lake Street Private Wealth LLC Sells 45,520 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3478
                    },
                    {
                        "summary": "Xometry Stock Falls 21% After Q4 Earnings Update And Leadership Change Nasdaq",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3221
                    },
                    {
                        "summary": "Dana Investment Advisors Inc. Sells 21,945 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2948
                    },
                    {
                        "summary": "Compound Planning Inc. Buys 7,804 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2938
                    }
                ],
                "analyst": [
                    {
                        "summary": "Exxon Mobil (XOM) Rating Update: Wells Fargo Raises Price Target GuruFocus",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.4091
                    }
                ]
            },
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Parr Mcknight Wealth Management Group LLC Sells 20,019 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2941
                    },
                    {
                        "summary": "RWA Wealth Partners LLC Trims Holdings in Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2893
                    },
                    {
                        "summary": "TD Asset Management Inc Purchases 427,619 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2742
                    }
                ],
                "analyst": [
                    {
                        "summary": "Exxon Mobil Corporation (NYSE:XOM) is included among the Goldman Sachs Dividend Stocks: Top 14 Stock Picks. On February 24, Wells Fargo analyst Sam Margolin raised the price recommendation on Exxon Mobil Corporation (NYSE:XOM) to $183 from $156. He maintained an Overweight rating on the shares. The firm said Exxon’s stock has helped lead the broader […]",
                        "source": "Yahoo! Finance: XOM News",
                        "semantic_score": 0.2965
                    },
                    {
                        "summary": "Analysts Conflicted on These Energy Names: Deep Yellow Limited (OtherDYLLF), TechnipFMC (FTI) and Exxon Mobil (XOM) The Globe and Mail",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.18
                    }
                ],
                "regulation": [
                    {
                        "summary": "A federal judge in Texas has ruled that ExxonMobil can bring a defamation lawsuit against California’s attorney general over comments about the company’s plastic recycling efforts. U.S. District Judge Michael J. Truncale in the Eastern District of Texas said in a ruling earlier this month that California Attorney General Rob Bonta cannot claim official immunity in regards to several statements he made, including one in a campaign email sent to Texas residents.",
                        "source": "Yahoo! Finance: XOM News",
                        "semantic_score": 0.3916
                    },
                    {
                        "summary": "Court tosses Exxon defamation lawsuit against environmental groups",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3874
                    }
                ],
                "general": [
                    {
                        "summary": "Assessing Exxon Mobil (XOM) Valuation After Growth Update And Ongoing Legal Actions simplywall.st",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3802
                    },
                    {
                        "summary": "Exxon Mobil: A Strong Developing Asset Portfolio (NYSE:XOM) Seeking Alpha",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3282
                    },
                    {
                        "summary": "If you are wondering whether Exxon Mobil's current share price really reflects its long term value, you are not alone. This article is designed to help you frame that question clearly. The stock last closed at US$149.26, with returns of 2.1% over 7 days, 10.6% over 30 days, 21.7% year to date, 40.7% over 1 year and 50.4% over 3 years, while the 5 year return is very large at 222.4%. Recent news flow around Exxon Mobil has focused on its position among major integrated energy companies and...",
                        "source": "Yahoo! Finance: XOM News",
                        "semantic_score": 0.3116
                    }
                ]
            },
            "2026-02-02": {
                "analyst": [
                    {
                        "summary": "Exxon Mobil (NYSE:XOM) Stock Price Down 2% Following Analyst Downgrade MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2842
                    }
                ],
                "corporate": [
                    {
                        "summary": "The Bull Case For Exxon Mobil (XOM) Could Change Following Record Output And Massive Buybacks – Learn Why Yahoo Finance",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3902
                    }
                ]
            },
            "2026-02-21": {
                "analyst": [
                    {
                        "summary": "ExxonMobil (NYSE: XOM) is proving that scale, discipline, and cash flow still matter. With $52 billion in operating cash flow, rising production from Guyana and Brazil, and 43 straight years of dividend growth, this energy titan may offer stability amid volatile markets. The upsi",
                        "source": "XOM Feed",
                        "semantic_score": 0.3447
                    }
                ],
                "corporate": [
                    {
                        "summary": "Key PointsExxonMobil has grown its annual dividend payout for 43 consecutive years.",
                        "source": "XOM Feed",
                        "semantic_score": 0.3303
                    }
                ],
                "earnings": [
                    {
                        "summary": "Exxon Mobil Corporation $XOM Position Boosted by Lion Street Advisors LLC MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3517
                    },
                    {
                        "summary": "Barings LLC Sells 21,895 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3094
                    },
                    {
                        "summary": "Dearborn Partners LLC Sells 8,837 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2851
                    },
                    {
                        "summary": "Exxon Mobil Corporation $XOM Shares Sold by Mitsubishi UFJ Asset Management UK Ltd. MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2666
                    }
                ]
            },
            "2026-02-10": {
                "corporate": [
                    {
                        "summary": "Cash Dividend On The Way From Exxon Mobil (XOM) Nasdaq",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2267
                    }
                ],
                "regulation": [
                    {
                        "summary": "Exxon exec says proposed European methane rules would add 13% to refiners' oil costs",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1956
                    }
                ]
            },
            "2026-02-04": {
                "corporate": [
                    {
                        "summary": "Exxon Mobil stock price today: XOM nears fresh highs as oil steadies and dividend date looms TechStock²",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3114
                    }
                ]
            },
            "2026-02-23": {
                "regulation": [
                    {
                        "summary": "U.S. Supreme Court to hear bid from Exxon, Suncor to stop climate change lawsuits",
                        "source": "Exxon Mobil Corporation - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3706
                    }
                ],
                "earnings": [
                    {
                        "summary": "Exxon Mobil Corporation $XOM Shares Sold by Payden & Rygel MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2873
                    },
                    {
                        "summary": "Private Advisory Group LLC Buys 34,916 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2748
                    },
                    {
                        "summary": "Vestmark Advisory Solutions Inc. Acquires 56,262 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.241
                    }
                ]
            },
            "2026-02-03": {
                "general": [
                    {
                        "summary": "Exxon Mobil: Strong Value Despite Oil Rout (NYSE:XOM) Seeking Alpha",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3608
                    }
                ]
            },
            "2026-02-26": {
                "general": [
                    {
                        "summary": "XOM.SW Exxon Mobil (SIX) jumps 35.04% to CHF101.01 pre-market 26 Feb 2026: watch volume-driven momentum Meyka",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.277
                    }
                ]
            },
            "2026-02-22": {
                "earnings": [
                    {
                        "summary": "Exxon Mobil Corporation $XOM Shares Bought by Hillsdale Investment Management Inc. MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3187
                    },
                    {
                        "summary": "Westerkirk Capital Inc. Takes Position in Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2927
                    },
                    {
                        "summary": "Sigma Planning Corp Cuts Stake in Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2729
                    },
                    {
                        "summary": "Jupiter Asset Management Ltd. Sells 14,641 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2664
                    }
                ]
            },
            "2026-02-17": {
                "earnings": [
                    {
                        "summary": "Exxon Mobil (NYSE:XOM) Stock Sold Off Rep. Gilbert Ray Cisneros, Jr. MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2572
                    }
                ]
            },
            "2026-02-12": {
                "earnings": [
                    {
                        "summary": "Exxon Mobil (NYSE:XOM) Shares Down 3.5% - Here's What Happened MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3471
                    }
                ]
            },
            "2026-02-15": {
                "earnings": [
                    {
                        "summary": "Shell Asset Management Co. Sells 55,733 Shares of Exxon Mobil Corporation $XOM MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2961
                    }
                ]
            },
            "2026-02-18": {
                "earnings": [
                    {
                        "summary": "Exxon Mobil (NYSE:XOM) Shares Down 1.6% - Here's Why MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3664
                    }
                ]
            },
            "2026-02-01": {
                "earnings": [
                    {
                        "summary": "Exxon Mobil Corporation $XOM Stock Holdings Lifted by Thrivent Financial for Lutherans MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.3535
                    }
                ]
            },
            "2026-01-29": {
                "earnings": [
                    {
                        "summary": "Why the Smart Money is Pensive Ahead of Exxon Mobil’s (XOM) Q4 Earnings Report Yahoo Finance",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.4326
                    }
                ]
            },
            "2026-02-16": {
                "earnings": [
                    {
                        "summary": "Sen. John Boozman Buys Exxon Mobil Corporation (NYSE:XOM) Shares MarketBeat",
                        "source": "\"XOM stock\" - Google News",
                        "semantic_score": 0.2581
                    }
                ]
            }
        }
    },
    "NFLX": {
        "news_count": 19,
        "30_day_news": {
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Moby summary of AMC Entertainment Holdings, Inc.'s Q4 2025 earnings call",
                        "source": "Yahoo! Finance: NFLX News",
                        "semantic_score": 0.4209
                    },
                    {
                        "summary": "Netflix (NASDAQ:NFLX) Stock Price Up 6% - Still a Buy? MarketBeat",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.3777
                    },
                    {
                        "summary": "Nasdaq, S&P 500 Futures Subdued Ahead Of Nvidia Earnings: Why WBD, NFLX, UNH, LCID, WULF Are On Traders' Radar Today Stocktwits",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.2832
                    },
                    {
                        "summary": "Investors Buy Large Volume of Netflix Call Options (NASDAQ:NFLX) MarketBeat",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.2717
                    },
                    {
                        "summary": "Magellan Asset Management Ltd Decreases Stock Holdings in Netflix, Inc. $NFLX MarketBeat",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.2623
                    }
                ],
                "corporate": [
                    {
                        "summary": "Netflix (NFLX) Navigates High-Stakes Merger Battle and Market Volatility International Business Times Australia",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.3492
                    }
                ],
                "management": [
                    {
                        "summary": "Netflix, Inc. (Nasdaq: NFLX) announced today that its CFO Spence Neumann will participate in a Q&A session at the Morgan Stanley Technology, Media & Telecom Conference on Wednesday, March 4, 2026. Mr. Neumann is scheduled to present at 1:50 p.m. Pacific Time / 4:50 p.m. Eastern Time.",
                        "source": "Yahoo! Finance: NFLX News",
                        "semantic_score": 0.1949
                    }
                ],
                "general": [
                    {
                        "summary": "Stocks making the biggest moves midday: Netflix, Coinbase, Diageo, Cava and more CNBC",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.3189
                    },
                    {
                        "summary": "4 stocks to watch on Wednesday: NVDA, NFLX, LOW, PYPL Seeking Alpha",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.1993
                    },
                    {
                        "summary": "Netflix: The Four-Day Countdown To Match - Or Walk (NASDAQ:NFLX) Seeking Alpha",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.1613
                    }
                ],
                "filing": [
                    {
                        "summary": "Coatue aggressively expanded its stake in NFLX stock from around 600,000 shares to about 6 million as of Q4.",
                        "source": "Yahoo! Finance: NFLX News",
                        "semantic_score": 0.2665
                    }
                ]
            },
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "Netflix (NASDAQ:NFLX) Shares Up 2.7% - Time to Buy? MarketBeat",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.3157
                    },
                    {
                        "summary": "Netflix (NASDAQ:NFLX) Trading Down 3.4% - Here's What Happened MarketBeat",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.3056
                    }
                ],
                "regulation": [
                    {
                        "summary": "Netflix Stock: Is NFLX Underperforming the Communication Services Sector? Yahoo Finance",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.3797
                    }
                ]
            },
            "2026-02-17": {
                "analyst": [
                    {
                        "summary": "Quant ratings on Renaissance Technologies' top holdings: PLTR, MU, NFLX",
                        "source": "Netflix, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.3135
                    }
                ],
                "general": [
                    {
                        "summary": "Coatue expands positions in NFLX, AMZN and cuts in GOOGL, META, among other Q4 moves",
                        "source": "Netflix, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.1256
                    }
                ]
            },
            "2026-02-23": {
                "general": [
                    {
                        "summary": "Is Netflix (NFLX) Fairly Priced After Recent Share Price Weakness? Yahoo Finance",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.2752
                    }
                ]
            },
            "2026-01-29": {
                "general": [
                    {
                        "summary": "Netflix Nosedive: Is NFLX Stock a Bargain With 60% Upside or a Trap? Yahoo Finance",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.3534
                    }
                ]
            },
            "2026-02-11": {
                "general": [
                    {
                        "summary": "$NFLX stock is down 3% today. Here's what we see in our data. Quiver Quantitative",
                        "source": "\"NFLX stock\" - Google News",
                        "semantic_score": 0.2936
                    }
                ]
            }
        }
    },
    "NKE": {
        "news_count": 32,
        "30_day_news": {
            "2026-02-24": {
                "earnings": [
                    {
                        "summary": "NKE faces $1.5B in tariff-driven costs, squeezing margins and profits as it ramps up efficiency moves to steady fiscal 2026 performance.",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.307
                    },
                    {
                        "summary": "Palumbo Wealth Management LLC Boosts Stake in NIKE, Inc. $NKE MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2816
                    },
                    {
                        "summary": "Clearstead Advisors LLC Trims Stock Position in NIKE, Inc. $NKE MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.1975
                    }
                ],
                "general": [
                    {
                        "summary": "Nike (NKE) Outpaces Stock Market Gains: What You Should Know Yahoo Finance Singapore",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.3266
                    },
                    {
                        "summary": "Evaluating Nike (NKE) Valuation After Recent Weak Share Price Performance simplywall.st",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.3231
                    },
                    {
                        "summary": "The latest trading day saw Nike (NKE) settling at $64.09, representing a +1.59% change from its previous close.",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.2546
                    },
                    {
                        "summary": "If you are wondering whether NIKE's current share price still reflects the strength of its brand or if value has opened up, this breakdown will walk through what the numbers actually say. NIKE shares last closed at US$63.09, with returns of 0.1% over 7 days, a 3.0% decline over 30 days, a 0.3% decline year to date, and declines of 19.6%, 43.9% and 50.9% over 1, 3 and 5 years respectively. Recent coverage around NIKE has focused on how a globally recognised sportswear brand is responding to...",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.2277
                    },
                    {
                        "summary": "NIKE (NKE) is back in focus after the Trump administration introduced a temporary 15% global import tariff for 150 days, reversing some relief that followed the U.S. Supreme Court’s decision to overturn earlier emergency tariffs. See our latest analysis for NIKE. Trade headlines have kept NIKE’s share price on a short leash, with a 1-day share price return of 1.58% to US$64.09 contrasting with a 1-year total shareholder return of 19.73% in the red. This suggests recent momentum is tentative...",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.2209
                    },
                    {
                        "summary": "U.S. Supreme Court ruling curbs presidential emergency tariff powers, affecting earlier duties on imports relevant to Nike. Administration quickly introduces new 15% global tariffs using different legal authority, keeping trade costs in flux for NYSE:NKE. Rapid policy reversal raises fresh questions around sourcing, pricing, and margin resilience for the footwear and apparel giant. Nike, traded as NYSE:NKE, is a global footwear and apparel company that relies heavily on cross border supply...",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.2167
                    }
                ]
            },
            "2026-02-17": {
                "earnings": [
                    {
                        "summary": "Honeywell (HON) announced that its Board of Directors has declared a quarterly dividend payment of $1.19 per share on the Company's common stock. The dividend is payable on March 13, 2026, out of surplus to holders of record at the close of business on February 27, 2026. NIKE (",
                        "source": "NKE Feed",
                        "semantic_score": 0.2038
                    }
                ],
                "general": [
                    {
                        "summary": "NKE launches broad innovation reset, doubling down on performance tech and retail basics to reignite growth and fend off rising athleticwear competition.",
                        "source": "NKE Feed",
                        "semantic_score": 0.1758
                    }
                ]
            },
            "2026-02-23": {
                "earnings": [
                    {
                        "summary": "NKE and LULU showcase scale vs. specialization, but which stock offers better upside as earnings dip and valuations diverge?",
                        "source": "NKE Feed",
                        "semantic_score": 0.4448
                    },
                    {
                        "summary": "Mcdonald Capital Investors Inc. CA Decreases Stake in NIKE, Inc. $NKE MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2351
                    }
                ],
                "general": [
                    {
                        "summary": "Key PointsNike experienced its biggest fiscal year of declining sales since 1987 last year.",
                        "source": "NKE Feed",
                        "semantic_score": 0.3276
                    },
                    {
                        "summary": "Why Nike (NKE) Stock Is Trading Lower Today Finviz",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2506
                    },
                    {
                        "summary": "Nike: Just Buy It (NYSE:NKE) Seeking Alpha",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.239
                    },
                    {
                        "summary": "Nike (NKE) Stock; Edges Lower as Trump Raises Global Tariff to 15% CoinCentral",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2277
                    },
                    {
                        "summary": "Shares of athletic apparel brand Nike (NYSE:NKE) fell 4.8% in the afternoon session after the Trump administration's announcement of new global tariffs, reignited trade policy uncertainty.",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.1529
                    }
                ]
            },
            "2026-02-21": {
                "earnings": [
                    {
                        "summary": "NIKE, Inc. $NKE Shares Sold by Raiffeisen Bank International AG MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2154
                    }
                ],
                "general": [
                    {
                        "summary": "Nike stock swings after Supreme Court tariff ruling; what NKE investors watch next week TechStock²",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.3491
                    },
                    {
                        "summary": "Nike stock slips after tariff court shock — what to watch before Monday for NKE TechStock²",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2933
                    }
                ]
            },
            "2026-02-20": {
                "earnings": [
                    {
                        "summary": "Fiera Capital Corp Buys 20,326 Shares of NIKE, Inc. $NKE MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2407
                    },
                    {
                        "summary": "NIKE, Inc. $NKE Shares Acquired by BNP PARIBAS ASSET MANAGEMENT Holding S.A. MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2398
                    },
                    {
                        "summary": "China Universal Asset Management Co. Ltd. Has $2.68 Million Holdings in NIKE, Inc. $NKE MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2146
                    }
                ]
            },
            "2026-02-19": {
                "earnings": [
                    {
                        "summary": "CenterBook Partners LP Purchases 35,474 Shares of NIKE, Inc. $NKE MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2603
                    }
                ]
            },
            "2026-01-30": {
                "earnings": [
                    {
                        "summary": "NIKE, Inc. $NKE Stock Position Decreased by New York State Common Retirement Fund MarketBeat",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.2409
                    }
                ]
            },
            "2026-02-25": {
                "earnings": [
                    {
                        "summary": "Madison Investments, an investment advisor, released its fourth-quarter 2025 investor letter for the “Madison Large Cap Fund”. A copy of the letter can be downloaded here. In the fourth quarter, the S&P 500 returned 2.65%, resulting in a full-year return of 17.9% for 2025. Over the last three years, the Index has achieved annual growth of […]",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.3945
                    },
                    {
                        "summary": "Justin Kramm, a Cannes Grand Prix-winning creative director whose career includes global campaigns for Nike, Red Bull, Intel, and Microsoft, has launched Shitshow Creative, a global collective of comedians, filmmakers, and designers helping mission-driven brands tell stories people actually want to watch.",
                        "source": "Yahoo! Finance: NKE News",
                        "semantic_score": 0.1359
                    }
                ],
                "general": [
                    {
                        "summary": "Here’s Why Madison Large Cap Fund Chose to Exit Nike (NKE) Insider Monkey",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.3225
                    }
                ]
            },
            "2026-02-18": {
                "general": [
                    {
                        "summary": "Nike (NKE) closed the most recent trading day at $65.55, moving +1.13% from the previous trading session.",
                        "source": "NKE Feed",
                        "semantic_score": 0.1738
                    }
                ]
            },
            "2026-02-09": {
                "general": [
                    {
                        "summary": "Nike Stock (NKE) Dips on News of Job Cuts at Converse Unit TipRanks",
                        "source": "\"NKE stock\" - Google News",
                        "semantic_score": 0.1959
                    }
                ]
            },
            "2026-01-29": {
                "general": [
                    {
                        "summary": "The world’s strongest brands in 2025, ranked",
                        "source": "NIKE, Inc. - News and Analysis on Seeking Alpha",
                        "semantic_score": 0.2506
                    }
                ]
            }
        }
    }
}